import React from 'react';
import { Container, Text, Button } from './LocksmithLecture.styled';
import { Link } from 'react-router-dom';

const LocksmithLecture = () => {
  return (
    <Container>
      <Link to={'/locksmith'}>
        <Button type="button">Go back</Button>
      </Link>
      <Text>
        <b>Технологія слюсарної обробки деталей</b> Види та характеристика
        слюсарних робіт. Робоче місце слюсаря. Оснащення робочого місця слюсаря.
        Робочий і контрольно-вимірювальний інструмент слюсаря, зберігання та
        догляд за ним. Поняття технологічного процесу. Технологія слюсарної
        обробки деталей. Основні технологічні операції слюсарної обробки:
        розмітка, рубання, різання, виправлення, згинання, обпилювання,
        свердління, нарізування різьби та їх характеристики. Слюсарні роботи
        відносяться до процесів холодної обробки металів різанням. 236 240 237
        Слюсарні роботи - це обробка металів, що, зазвичай, доповнює станочну
        механічну обробку або завершує виготовлення металевих виробів з’єднанням
        деталей, збіркою машин та механізмів, а також їх регулюванням.
        Здійснюються вони і вручну, і за допомогою механізованого інструменту.
        Мета слюсарних робіт - надати оброблюваній деталі задані кресленням
        форми, розміри і чистоту поверхні. Якість виконуваних слюсарних робіт
        залежить від уміння і навиків слюсаря, вживаного інструменту і
        оброблюваного матеріалу. 3d slider 04 Технологія - це процес послідовної
        зміни стану, властивостей, структури, форми та інших характеристик
        предметів праці з метою виготовлення певної продукції. depositphotos
        3959388 stock photo metallurgical works industrial production process 4
        Виробничий процес — систематичне та цілеспрямоване змінювання в часі та
        просторі кількісних та якісних характеристик засобів виробництва і
        робочої сили для отримання готової продукції з вихідної сировини згідно
        із заданою програмою. decades in the making this technology may be
        moores laws savior c3 employee barseback Технологічний процес — це
        частина виробничого процесу, що вміщує дії зі зміни стану предмета
        праці. Технологія слюсарної обробки містить ряд операцій, в які входять:
        розмітка, вирубування, правка і згинання металів, різання металів,
        обпилювання, свердління, зенкування і розгортання отворів, нарізування
        різьби, клепка, шабрування, притирання і доведення, паяння і лудіння,
        заливка підшипників, з'єднання склеюванням і ін. Слюсарно-складальні
        роботи виконуються при збірці вузлів з окремих деталей і при збірці
        машини з окремих вузлів. При збірці застосовуються всі основні види
        слюсарних робіт, у тому числі і пригін збираних деталей у вузли з
        подальшим регулюванням і перевіркою правильності роботи механізмів і
        машин. Слюсарно-ремонтні роботи з метою підтримки працездатності
        устаткування полягають у виправленні або заміні зношених і пошкоджених
        деталей машин. Об'єм слюсарної обробки значною мірою характеризує
        технічний рівень застосованої технології і залежить від характеру
        виробництва. На машинобудівних заводах, що випускають різнорідну
        продукцію в невеликих кількостях (одиничне виробництво), питома вага
        слюсарних робіт особливо велика. Тут слюсар зобов'язаний виконувати
        найрізноманітніші слюсарні роботи, тобто бути слюсарем-універсалом. При
        необхідності він проводить ремонт і монтаж верстатів, виготовляє
        оснастку і т.п. У серійному виробництві, де виготовляються однорідні
        деталі великими партіями, підвищується точність механічної обробки і
        відповідно цьому об'єм слюсарних робіт дещо зменшується. Праця слюсарів
        необхідна і на заводах масового виробництва, де однорідна продукція
        випускається у великих кількостях і тривалий час (рік, два і більше). На
        всіх фабриках і заводах та невеликих приватних та державних
        підприємствах незалежно від типу виробництва слюсарі потрібні для
        виготовлення штампів, оснастки і інструментів, для виконання ремонту і
        монтажу промислового устаткування, санітарно-технічних робіт,
        промислової вентиляції і ін. Без слюсарів не обійтися в сучасному
        сільському господарстві; тут вони здійснюють ремонт тракторів, комбайнів
        і іншої техніки. Робочим місцем називається певна ділянка виробничої
        площі цеху, відділення, ділянки або майстерні, закріплена за даним
        робітником (або бригадою робітників), призначена для виконання певної
        роботи. Кожне робоче місце оснащується комплектом
        організаційно-технічних пристроїв - оргтехоснасткою, яка повинна
        забезпечити не лише зручності при виконанні закріпленої роботи, але і
        безпеку праці; раціональну побудову трудового процесу і фізіологічно
        правильну робочу позу; раціональне розміщення і строгий порядок
        зберігання інструментів, оснастки, заготовок, готової продукції і т.п.,
        а також підтримку чистоти і порядку на робочому місці. Наукова
        організація праці слюсаря на його робочому місці передбачає, перш за
        все, максимальне заощадження робочого часу. Раціональна організація
        робочого місця повинна, по-перше, забезпечувати умови для високої
        продуктивності праці, по-друге, передбачати раціональний трудовий
        процес, який економить робочий час і сили робітника, позбавляє його від
        зайвих і незручних рухів і забезпечує високу продуктивність праці і
        якість роботи і, по-третє, повинна максимально скорочувати час на ручні
        прийоми і інші непродуктивні витрати часу. Для створення раціонально
        обладнаних робочих місць мають бути виконані наступні вимоги НОП: а)
        точно визначений і закріплений перелік роботи на робочому місці; б)
        встановлена система обслуговування робочих місць матеріалами,
        заготовками, інструментом, оснасткою і деталями без відриву основних
        робітників, тобто слюсарів, від виконання головних операцій; в)
        визначений комплект організаційно-технічного оснащення для розміщення і
        зберігання на робочому місці інструментів, оснастки, матеріалів і ін., а
        також створення зручностей робітникові при виконанні технологічних
        операцій; г) здійснено раціональне планування робочих місць, що
        позбавляє робітників від зайвих і утомливих трудових рухів і, що
        забезпечує зручну робочу позу, раціональність трудового процесу і
        безпеку роботи. 241 242 В цілях економії рухів і усунення непотрібних
        пошуків предмети на робочому місці ділять на предмети постійного і
        тимчасового користування, за якими постійно закріплені місця зберігання
        і розташування. Робоче місце слюсаря організовується залежно від змісту
        виробничого завдання і типу виробництва (одиничне, серійне, масове).
        Проте більшість робочих місць обладнується, як правило, слюсарним
        верстаком, на якому встановлюють і закріплюють лещата. Конструкція
        верстака, його стійкість і міцність, оснащеність робочого місця різними
        пристосуваннями, що механізують ручну працю, роблять безпосередній вплив
        на продуктивність праці слюсаря. Верстак має бути зручний для роботи.
        Каркас верстака виготовляють, як правило, металевим, столешніцу (кришку
        верстака) з дощок завтовшки 40 -50 мм. Така столешніца не прогинається і
        не тремтить під час роботи. Зверху вона покривається покрівельним
        залізом або фанерою. З усіх боків столешніци кріпляться дерев'яні
        планки-борти, що перешкоджають падінню з верстака дрібних предметів. Під
        столешніцею верстака встановлюються висувні ящики для зберігання в
        певному порядку інструментів і допоміжних матеріалів. Висота верстака
        750-900 мм, довжина 1000-1200 мм, ширина 700-800 мм. Слюсарні верстаки
        виготовляються одномісні і багатомісні. Зони, досяжності рук робітника,
        що працює стоячи, дають можливість визначити найбільш вигідне
        розташування всіх предметів по відношенню до зросту робітника. Керуючись
        цими зонами, слід визначати, на якій висоті від підлоги повинні
        знаходитися матеріали заготовки, деталі, оснастка і ін., щоб робітникові
        не доводилося низько нахилятися. Всі предмети, які доводиться брати
        двома руками, кладуть прямо перед робітником. По можливості слід уникати
        такого розміщення предметів, яке вимагає при виконанні робіт поворотів і
        особливо нагинання корпусу, а також перекладання предметів з однієї руки
        в іншу. FFFFF0 Зони досяжності рук людини: а - в горизонтальній площині
        при роботі стоячи і сидячи (1 - нормальна робоча зона; 2 - максимальна
        робоча зона (зона досяжності рук); 3 - максимальна зона досяжності рук
        при нахилі корпусу вперед не більше 300); б - в вертикальній площині при
        роботі стоячи; в - в вертикальній площині, що враховуються при
        плануванні робочих місць. При організації робочого місця враховується
        стан підлоги, яка повинна бути міцною, не стиратися, стійкою до ударів,
        протисненню та іншим механічним впливам. Підлога повинна бути гладкою,
        не створювати шуму при ходінні, не виділяти пилу, легко піддаватися
        ремонту, чистці, миттю; підлога повинна бути не слизькою, але пружною.
        Поряд з цим, підлога повинна бути стійкою до хімічного впливу кислот,
        лугів та мінеральних мастил. Підлога буває дерев’яною (з дощок або
        паркету), бетонною, цементною, мозаїчною, мармуровою, а також вкрита
        лінолеумом або іншими синтетичними матеріалами. Загальне і місцеве
        освітлення в механоскладальних цехах повинно дорівнювати 500 лк, на
        лекальних роботах і у відділах полірування і доводки 2000 лк, на
        контрольних операціях 750-2000 лк. Перевага надається люмінесцентним
        світильникам денного або білого світла. Рекомендовані температури
        навколишнього середовища в приміщенні: при виконанні легких робіт -
        18-20 0С, робіт середньої важкості - 16-18 0С і важких робіт - 14-16 0С.
        При необхідності працювати в приміщеннях, де шум перевищує допустимі
        норми (75-85 дБ), користуються протишумними навушниками. При виборі
        кольору для оформлення приміщень та устаткування треба орієнтуватися
        перш за все на ті кольори, які відображають не менше 40-50% падаючого на
        них світла. Відповідно до цього пропонується для оформлення цехів
        використовувати наступні кольори: для стель залізобетонних перекриттів,
        а також для металоконструкцій - білий, світло-лимонний; для стін,
        перегородок - білий, світло-зелений, світло-блакитний, світло-жовтий,
        бірюзовий і інші світлі тона. Ці кольори сприятимуть збільшенню
        освітленості і, отже, меншій зоровій напрузі працюючого, зниженню
        стомлюваності, підвищенню продуктивності праці і якості роботи.
        Забарвлення приміщень в світлі тони дає також економію електроенергії.
        Якщо предмети або конструкції будівель забарвлювати в світлі тони, то
        вони створюватимуть відчуття легкості. Стелі і ферми, забарвлені в білий
        колір, не давитимуть своїм тягарем і масивністю.
      </Text>
      <Text>
        <b>Слюсарні лещата</b> Слюсарні лещата представляють собою затискні
        пристрої для утримання оброблюваної деталі в потрібному положенні. В
        залежності від характеру роботи застосовують стулові, паралельні та
        ручні лещата. ccb0270441e7913132e20b903c63 Стулові лещата служать для
        виконання важких робіт, що супроводжуються сильними ударами
        (вирубування, гнуття, клепка і ін.). Вони складаються з нерухомої і
        рухомої губок. При обертанні затискного гвинта рухома губка
        переміщається і затискає деталь; при вигвинчуванні гвинта під дією
        пружини рухомаа губка відходить і звільнює деталь. Кріплення стулових
        лещат до верстака виконують планкою (лапками), а для більшої стійкості
        нерухома губка має подовжений стержень, який кріпиться до ножки
        верстака. Рухому і нерухому губки стулових лещат відковують із
        конструкційної вуглеводистої сталі. На робочі частини губок наварюється
        накладка із інструментальної сталі марок У7, У8 або закріплюються на
        гвинтах спеціальні пластини накладні губки. робочі поверхні цих пластин
        насікаються хрестоподібною насічкою і закаляються. Стулові лещата
        відрізняються простотою конструкції і високою міцністю. Однак вони не
        позбавлені і недоліків: робочі поверхні губок не у всіх положеннях
        паралельні один одному, що знижує точність обробки; тонкі заготовки
        затискаються лише верхніми краями губок, грубі - лише нижніми, що не
        забезпечує достатньої міцності кріплення. Паралельні лещата з ручним
        приводом бувають поворотними, неповоротними, інструментальними з вільним
        ходом передньої губки та з регульованою висотою підйому лещат. i 003
        Поворотні паралельні лещата можуть повертатися на кут 600. Ці лещата в
        корпусі нерухомої губки 9 мають наскрізний прямокутний виріз, в який
        поміщена гайка 10 затискного гвинта. У виріз входить прямокутний з
        наскрізним отвором призматичний хвостовик рухомої губки 7. Затискний
        гвинт 11, пропущений через отвір корпусу рухомої губки, закріплений
        стопорною планкою 6. При обертанні затискного гвинта в ту або іншу
        сторону за допомогою важеля 5 гвинт угвинчуватиметься в гайку 10 або
        вигвинчуватиметься з неї і відповідно переміщати рухому губку 7, яка,
        наближаючись до нерухомої губки 9, затискатиме оброблюваний предмет, а
        віддаляючись - звільняти. Нерухома губка лещат сполучена з основою 3
        центровим болтом, довкола якого і здійснюється необхідний поворот
        поворотної частини 4 (не менше 60° в кожну сторону). Поворотну частину 4
        лещат закріплюють в необхідному положенні за допомогою рукоятки 2 болтом
        1. Корпус паралельних слюсарних лещат виготовляють з сірого чавуну. Для
        збільшення терміну служби лещат до робочих частин губок прикріплюють
        гвинтами сталеві (з інструментальної сталі У8) пластини 8 з
        хрестоподібною насічкою. При затиску в лещатах на оброблюваних предметах
        можуть з'являтися вм’ятини від насічки загартованих пластин губок. Тому
        для затиску обробленої чистової поверхні деталі (виробу) робочі частини
        губок лещат закривають накладними пластинами («нагубниками»),
        виготовленими з м'якої сталі, латуні, червоної міді, алюмінію, шкіри і
        ін. Розміри слюсарних лещат визначаються шириною їх губок, яка для лещат
        поворотних складає: 80, 140 мм з найбільшим розкриттям губок 95, 180 мм.
        239 Неповоротні паралельні лещата - мають основу 6, за допомогою якої
        вони кріпляться болтами до кришки верстака, нерухому губку 4 і рухому 2.
        Для збільшення терміну служби робочі частини губок 4 і 2 роблять
        змінними у вигляді призматичних пластинок 3 з хрестоподібною насічкою з
        інструментальної сталі У8 і прикріплюють до губок гвинтами. Рухома губка
        2 переміщається своїм хвостовиком в прямокутному вирізі нерухомої губки
        4 обертанням гвинта 5 в гайці 7 за допомогою важеля 1. Від осьового
        переміщення в рухомій губці затискний гвинт 5 стримується стопорною
        планкою 8. Ширина губок неповоротних лещат 80, 140 мм з найбільшим
        розкриттям губок 95, 180 мм. 244 Лещата з додатковими губками для труб
        окрім загального призначення можуть бути використані для закріплення
        труб завдяки додатковому призматичному вирізу. Найбільші діаметри труб,
        що затискаються: 60, 70, 140 мм. Не дивлячись на перевагу паралельних
        лещат, що полягає в міцному кріпленні до верстака, вони мають недолік:
        мала міцність губок. Тому для важких робіт ці лещата непридатні. 243
        Лещата з вільним ходом - це зручність і швидкість установки деталей.
        Лещата до верстака притискує плита 7. Під внутрішньою нерухомою губкою 2
        - рухома 3, а між нею і плитою - дві пиловидні рейки 4, з ними в
        зачепленні - зубчата гайка 6, зафіксована на гвинті 5. Слюсар,
        повертаючи рукоятку вліво, виводить гайку із зачеплення з рейками, і
        потягнувши важіль на себе звільняє рухому губку. Так легко і просто
        встановлюється необхідний зазор між змінними щічками 1. Щоб затиснути
        деталь, потрібно виконати цю нескладну операцію в зворотному порядку.
        image 11 Пневматичні лещата забезпечують швидкий і надійний затиск
        деталей з постійним зусиллям без застосування фізичної сили. Тривалість
        затиску складає 2-3 с, зусилля затиску 300 кгс. Пневматичні лещата з
        діафрагменним затиском складаються з основи 1, поворотної частини 2,
        закріпленої в необхідному положенні болтами 3, рухомої губки 5,
        розміщенній в пазу поворотної частини 2, і нерухомої губки 6, скріпленої
        з цією поворотною частиною. Усередині поворотної частини 2 переміщається
        каретка 7, сполучена ходовим гвинтом 8 з рухомою губкою 5. Обертаючи
        ходовий гвинт рукояткою 4, стає можливим міняти відстань між обома
        губками лещат. У тому випадку, коли повітря не поступає в лещата, їх
        губки під дією пружини 9 знаходяться в крайньому розкритому положенні.
        Коли ж стисле повітря під тиском 5-6 ат поступає в камеру лещат, шток 10
        опускається і повертає важіль 11, що знаходиться в каретці, який
        натискує на каретку своїм коротким плечем через штовхач 12 і тягне
        рухому губку, що затискає деталь. Повітряна камера лещат утворюється
        стінками основи 1 і гумовою діафрагмою 13. Повітря через діафрагму тисне
        на опорне кільце 14 штока і створює необхідне зусилля. У описаних
        лещатах представляється можливим затискати заготовки розміром не більше
        80 мм. Пневматичні лещата виготовляють також з клиновим затиском і інших
        конструкцій з різним зусиллям затиску. 585 Лещата з регульованою висотою
        підйому. Тут у верстак вмонтована товстостінна труба 2, міцно закріплена
        в каркасі 3; циліндричний хвостовик лещат 1 вільно встановлюється на
        необхідній висоті і міцно закріплюється гвинтом 4. У ряді слюсарних
        майстерень застосовуються одномісні верстаки, забезпечені вмонтованими в
        ніжки верстака гвинтами, за допомогою яких регулюється висота установки
        верстака і лещат по зросту працючого.
      </Text>
    </Container>
  );
};

export default LocksmithLecture;
