import React from 'react';
import { Container, Button, Text, Img } from './webDesignAbout.styled';
import { Link } from 'react-router-dom';
import web from '../../../images/Web/webAbout.png';

const WebAbout = () => {
  return (
    <Container>
      <Link to={'/web'}>
        <Button type="button">Go back</Button>
      </Link>
      <Img src={web} alt="Web" />
      <Text>
        <b>Веб-дизайнер</b> — це фахівець в IT, який у команді робить сайти та
        мобільні додатки. Він малює лендінги, багатосторінкові сайти, макети
        інтернет-магазинів і веб-додатків. Оформлення Netflix або сайту Rozetka
        — робота веб-дизайнера. Уявімо, що сайт — це вітрина. Завдання
        веб-дизайнера — зробити так, щоб ця вітрина була зручною, цікавою і
        корисною. Розглянемо на прикладах. Веб-дизайнер — архітектор для сайтів.
        Він придумує розташування елементів і кольору, картинки — так, щоб це
        було зручно відвідувачам сайту. А власник сайту отримував вигоду від
        продукту: клієнти знаходять потрібний товар, сторінку блогу або можуть
        прочитати важливий текст на кшталт вигод покупки. Він не програмує, а
        створює архітектуру. Якщо говорити простіше — малює картинку сайту. Далі
        програміст за допомогою коду переносить картинку на робочий сайт.
        Додатково налаштовує товари, кнопки, посилання та інші інтерактивні
        елементи. Головне для фахівця — дизайн у веб-середовищі: робота з
        сайтами, сервісами, додатками. Решту потрібно знати в основах. Не
        потрібно писати рекламні тексти або досконально верстати сайти. Досить
        пройти вступні курси, щоб розібратися у сфері та правилах. Копірайтеру
        підкажете, де тексту багато і він не поміститься. А недосвідченому
        верстальнику — як перенести блок або кнопку, якщо не виходить.
        Професійні навички можна освоїти під час навчання і практики: Редактори
        для дизайну. Найкращий — Figma. На то є дві причини: у ньому показує
        готовий код стилів для верстальника, і редактор робили для вебпроєктів:
        налаштування для макетів, перенесення картинок у два кліки, робота на
        одній сторінці в команді. Додатково дизайнери вчать графічні та
        фоторедактори, наприклад Adobe Illustrator або Photoshop. Основи
        дизайну: композиції, перспективи, типографіки та кольорова палітра.
        Основи дизайну інтерфейсів (UX і UI-дизайн) — розуміти, куди на сайтах
        розміщувати елементи і чому це правильно, зручно і корисно для
        відвідувачів. Основи анімації — зараз популярні сайти з ефектами, на
        кшталт мерехтливих кнопок, спливаючого тексту або рухомих картинок. Їх
        може зробити і веб-дизайнер.
      </Text>
    </Container>
  );
};

export default WebAbout;
