import React from 'react';
import { Container, Text, Button } from './DriverLecture.styled';
import { Link } from 'react-router-dom';

const DriverLecture = () => {
  return (
    <Container>
      <Link to={'/driver'}>
        <Button type="button">Go back</Button>
      </Link>
      <Text>
        <b>Техніка керування автомобілем</b> Підготовка автомобіля в цілому й
        робочого місця водія дає змогу зокрема зменшити його втомлюваність,
        поліпшує фізичний і психічний стан у процесі роботи, зменшує
        навантаження, робить працю безпечнішою. Посадка водія за кермом має
        важливе значення для безаварійної роботи. При правильній посадці
        забезпечується хороший огляд дороги, зручне користування органами
        управління, найменша втома водія, підтримується добре самопочуття. Це
        залежить в основному від правильного регулювання сидіння водія в
        залежності від його росту. Дослідним шляхом встановлено, що оптимальне
        положення водія доцільно визначати трьома головними місцями опори
        (спина, поясниця і ноги) та кутом положення корпуса (85... 95°) і ніг
        (120... 130 °) у колінному згині. Правильне положення водія за кермом
        дозволяє йому зручно тримати рульове кермо двома руками. Для
        встановлення правильного положення рук на рульовому кермі доцільно
        розділити його обіг по колу горизонтальною лінією. Якщо порівняти обід
        рульового колеса з циферблатом годинника, то найкраще розміщення рук
        приблизно таке: ліва рука розміщена на цифрі 9, а права - на цифрі 3.
        При правильному регулюванні сидіння коліна, як правило, висунуті вперед,
        знаходяться приблизно на відстані 50 мм від нижнього краю рульового
        колеса, а відстань від рульового колеса до грудей водія дозволяє йому
        безперешкодно виконувати необхідні маніпуляції органами управління:
        педалями, показникамиповоротів і т.п. При різних умовах навчитись
        технічно і грамотно керувати автомобілем - задача не проста, але
        вирішувана. Сама посадка за кермом повинна бути не вимушеною. Не
        потрібно без необхідності тримати ноги на педалях зчеплення або гальм,
        бо під час руху можливо випадково натиснути на ці педалі. Натискати на
        педаль управління дросельними заслінками карбюратора рекомендується
        плавно, а також плавно відпускати передньою частиною ступні 17 з упором
        ноги на каблук (підбор). Пуск двигуна. Перед пуском необхідно перевірити
        положення важелів: стоянкове гальмо повинно бути включене, важіль
        переключення передач переведений у нейтральне положення. Для пуску
        холодного двигуна потрібно закрити повітряну заслінку, натиснути 2-3
        рази на педаль подачі палива (спрацює насос-прискорювач і впирсне в
        дифузор карбюратора паливо, із метою полегшення процесу пуску); потім
        натиснути на педаль зчеплення (для зменшення опору провертання
        колінчатого вала); повернути ключ запалювання за годинниковою стрілкою,
        одночасно легко натиснувши на педаль подачі палива; відпустити ключ
        запалювання, а педаль зчеплення відпустити негайно після пуску двигуна.
        Якщо з першого разу двигун не запустився, то варто повторити поворот
        ключа запалювання через 5.. .10 с. У випадку відсутності пуску можна
        спробувати відкрити повітряну заслінку і, плавно натиснувши на педаль
        подачі палива, потримати її в цьому положенні 10.15 с та повторити
        включення запалювання. Якщо і це не допомагає, потрібно перевірити
        справність систем запалювання і живлення та наявність палива в
        карбюраторі. При пуску прогрітого двигуна не слід закривати повітряну
        заслінку і натискати попередньо на педаль подачі палива, тому що
        надмірне збагачення в даному випадку лише утруднить процес пуску. Після
        запуску двигуна перевірити показники контрольно-вимірювальних приладів,
        звернувши особливу увагу на тиск оливи, індикатор рівня гальмівної
        рідини (тиск повітря в системі пневматичного приводу робочої системи
        гальм) та наявність палива. При перемиканні передач в КПП не потрібно
        застосовувати великих зусиль для переключання. Переміщувати важіль на
        себе доцільно пальцями рук, а від себе - відкритою долонею без зусиль,
        ривків і нахилу тулуба вперед.
      </Text>
      <Text>
        <b>Етика поведінки учасників дорожнього руху</b> Недисциплінованість
        учасників дорожнього руху найчастіше проявляється в нехтуванні ПДР.
        Водій повинен турбуватись не тільки про особисту безпеку, а й про
        безпеку інших учасників руху, стежити за їх діями. Кожний учасник
        дорожнього руху може почуватись набагато впевненіше, коли інші учасники
        будуть доброзичливими, готовими виручити. Це особливо відчувається, коли
        можна отримати допомогу від проїжджаючих або проходячих водіїв,
        пішоходів. Досить часто водії не знають, як поводитися при зустрічі з
        працівником ДАІ. Якщо вас зупиняє будь-який працівник міліції, потрібно
        обов’язково зупинитись із дотриманням ПДР. При зупинці потрібно
        обов’язково запитати про причину зупинки, тобто що саме ви порушили.
        Інспектору рекомендовано зупиняти транспортні засоби за наявності ознак
        правопорушення ( Наказ МВС №1111 від 13.11.06 року, який затверджує
        інструкцію з діяльності підрозділів ДПС ДАІ МВС України). Підставою для
        зупинення транспортних засобів є: - порушення правил дорожнього руху
        водіями або пасажирами; - характер руху транспортного засобу викликає
        підозру в спроможності водія керувати ним (різка зміна напрямку і (або)
        швидкісного режиму); - відсутність номерних(ного) знаків(ка) на
        транспортному засобі або талона про проходження державного технічного
        огляду; - наявність ознак, які свідчать про технічну несправність
        транспортного засобу; - приховані номерні знаки транспортного засобу; -
        наявність даних, що свідчать про причетність транспортного засобу,
        водія, пасажирів до скоєння ДТП, злочину чи адміністративного
        правопорушення; - знаходження транспортного засобу в розшуку, а також
        наявність даних про використання транспортного засобу з протиправною
        метою; 21 - необхідність опитування водія чи пасажирів про обставини
        скоєння ДТП, адміністративного правопорушення, злочину, свідками якого
        вони є або могли бути; - необхідність залучення водія транспортного
        засобу для надання допомоги іншим учасникам дорожнього руху або
        працівникам міліції, або як свідка при оформленні адміністративних
        матеріалів; - проведення цільових заходів (операції, відпрацювання,
        оперативні плани) для перевірки документів на право користування і
        керування транспортним засобом, а також документів на транспортний засіб
        і вантаж; - виконання рішень уповноважених на те державних органів або
        посадових осіб про обмеження чи заборону руху. Забороняється зупиняти
        транспортні засоби без наявних на те підстав. Після зупинки вимагайте в
        інспектора пояснень, що саме ви порушили. Після зупинки вам не
        обов’язково виходити з машини. Ні один нормативно-правовий акт водія до
        цього не зобов’язує. Працівник ДПС при зупинці транспортного засобу
        зобов’язаний без затримки підійти до водія. Для розмови з водієм не
        обов’язково запрошувати його вийти з автомобіля, крім наступних
        випадків: - якщо перебування працівника ДПС поруч із зупиненим
        транспортним засобом створює загрозу особистій безпеці працівника. У
        цьому випадку розмову з водієм слід проводити на тротуарі (узбіччі); -
        із метою усунення технічної несправності транспортного засобу або
        порушень правил перевезення вантажів; - коли є достатні підстави
        вважати, що водій перебуває в стані сп’яніння; - для проведення (у
        присутності водія) порівняння ідентифікаційних номерів вузлів і
        агрегатів транспортного засобу із записами в реєстраційних документах; -
        коли водій або пасажири підозрюються в скоєнні злочину; - у інших
        випадках, коли є необхідною участь водія в оформленні 22 документів або
        наданні допомоги іншим учасникам дорожнього руху. Якщо на безлюдній
        дорозі (у темний час доби) вас намагається зупинити працівник ДАІ (якщо
        він здається вам підозрілим), можете не зупинятись. Але ваші шанси
        доїхати до першого поста ДАІ можуть дорівнювати нулю. Працівники міліції
        можуть використати табельну зброю. Тому краще зупиніться, але дверцята
        авто обов’язково зачиніть. Забороняється зупиняти транспортні засоби на
        ділянках доріг з обмеженою видимістю, до і після повороту, безпосередньо
        перед перехрестями, у зоні залізничних переїздів та в інших небезпечних
        місцях, за винятком випадків необхідності їх невідкладного зупинення для
        уникнення настання тяжких наслідків. Працівник ДАІ має обов’язково
        представитись, назвати своє ім’я, прізвище та посаду. При зверненні до
        учасників дорожнього руху працівник ДПС повинен чітко
        відрекомендуватися, назвавши свою посаду, спеціальне звання й прізвище,
        та повідомити про причину зупинки транспортного засобу і суть скоєного
        правопорушення. У разі звернення громадян (щодо надання допомоги,
        отримання інформації про злочин і т.п.) працівник ДПС, виконавши ті ж
        самі вимоги, у межах своєї компетенції, зобов’язаний вжити заходи щодо
        надання допомоги і діяти відповідно до своїх функціональних обов’язків.
        На вимогу громадянина працівник ДПС ДАІ зобов’язаний пред’явити службове
        посвідчення. Переписати номер жетона працівника ДАІ. Дізнатися про
        причину зупинки (на підставі п. 2.14 ПДР). У випадку проявлення перших
        ознак неввічливого ставлення вимагати надати службове посвідчення (на
        підставі наказу МВС №1111). Прізвище, ім ’ я по батькові та посаду
        переписати на листок паперу (для можливої подачі скарги до вищого за
        ієрархією підрозділу, прокуратури та суду). Щодо неввічливого ставлення:
        У розмові з громадянами працівники ДПС зобов’язані виявляти спокій і
        витримку. Недопустимі: гордовитий тон, грубощі, вирази та репліки, які
        23 ображають людську гідність, будь-які дії, що свідчать про неповагу до
        громадян, коментарі, які не стосуються виконання службових обов’язків.
        Роз’яснення порушникові про неправомірність його дій необхідно давати
        доброзичливо, переконливо і ясно, з посиланням на відповідні вимоги ПДР
        та інших нормативно-правових актів України у сфері безпеки дорожнього
        руху. При перевірці документів із ними слід поводитися акуратно, не
        робити в них будь-яких поміток. Якщо в документи вкладені гроші чи цінні
        папери, необхідно запропонувати власникові забрати їх. На вимогу
        показати багажник або салон вимагайте пояснення причин огляду
        транспортного засобу (на підставі пп. "в" п. 2.14 ПДР). Вимагайте
        пояснити права затриманої особи та надати пояснення в письмовому
        вигляді. При складанні протоколу працівник ДПС зобов’язаний роз’яснити
        особі її права, передбачені Кодексом України про адміністративні
        правопорушення, а саме: щодо можливості ознайомитися з матеріалами
        справи, давати пояснення, надавати докази, заявляти клопотання, при
        розгляді справи користуватися юридичною допомогою адвоката, говорити
        рідною мовою й користуватися послугами перекладача, якщо він не володіє
        мовою, якою ведеться провадження, оскаржувати рішення по справі в
        установленому порядку. Зателефонувати за телефоном довіри в Департамент
        ДАІ МВС України (044) 272-46-59 (який має бути записаний у пам’ять
        телефону) і повідомити про намагання провести незаконний огляд
        транспортного засобу. Крім вищевказаного, рекомендується мати телефони
        довіри управління ДАІ областей, які можна побачити на офіційному сайті
        Департаменту ДАІ МВС України. Написати скаргу на дії працівників ДАІ у
        вищу інстанцію, прокуратуру (суд). Відрізнити інспектора ДАІ можна за
        формою. Працівники ДАІ мають бути одягненими в темно-синю форму та
        кашкети циліндричної форми. У темний час доби - у жилети з жовтими
        світло-відбиваючими смугами на 24 написом «ДПС». Крім того, старі значки
        на куртках відміняють. Замість них, на груди повісять із одного боку
        п’ятизубу зірку, з іншого - металеву табличку. На зірці буде назва
        регіону, а на табличці - прізвище, ім’я та по батькові. У більшості
        областей така форма вже з’явилася. При складанні протоколу про
        адміністративне правопорушення після того, як його заповнить інспектор,
        обов’язково треба написати пояснення. Відмова в дачі пояснення буде
        прирівняна до визнання правопорушення усі пусті графи проставити. У
        рядку "Підпис порушника" перекреслити слово "Порушник" і підписатися
        нижче.
      </Text>
    </Container>
  );
};

export default DriverLecture;
