import React from 'react';
import { Container, Button, Text, Img } from './PsychologistAbout.styled';
import { Link } from 'react-router-dom';
import psychologist from '../../../images/Psychologist/psychologistAbout.png';

const PsychologistAbout = () => {
  return (
    <Container>
      <Link to={'/psychologist'}>
        <Button type="button">Go back</Button>
      </Link>
      <Img src={psychologist} alt="Psychologist" />
      <Text>
        <b>Психолог</b> – це кваліфікований спеціаліст, який займається
        вивченням та коригуванням душевного стану людини, яка до нього
        звернулась за допомогою. Психолог може надавати допомогу в особистісних
        проблемах та у взаємовідносинах, допомагає адаптуватися та навчитися
        контактувати з оточуючими. Основне завдання психолога полягає у тому,
        щоб покращити емоційний стан та самопочуття людини.
      </Text>
      <Text>
        <b>Опис професії</b> Професія психолога у сучасному суспільстві має
        неабияку престижність, актуальність та затребуваність. Практично у
        кожному навчальному закладі, компанії, промисловому підприємстві є
        кваліфіковані фахівці, які допомагають людям знайти вихід з проблемних
        ситуацій та покращити свій душевний стан. Тому зовсім не дивно, що
        отримати диплом психолога можна практично у всіх ВНЗ світу. Робота
        психолога далека від тої картинки, яку нам сформувало телебачення. Адже
        психолог – це не лише спеціаліст, до якого приходять люди, лягають на
        кушетку і «виливають» свої проблеми. Насправді, професія більш поширена
        та використовується у багатьох напрямках. Найбільше психологів на
        сьогоднішній день працюють у сфері освіти: у дитячих садочках, школах,
        інтернатах, освітніх центрах і т.д. Вони проводять різні тестування
        серед учнів для визначення особистісних якостей кожної дитини
        індивідуально. Це допомагає скласти психологічний портрет дитини та
        більш комплексно підійти до процесу навчання чи виховання. Особливо
        цінна робота психолога із дітьми, які мають певні труднощі, затримки
        розвитку. Через проведення консультацій та бесід, психолог допомагає
        дитині відновити душевний та емоційний стан, адаптуватися, покращити
        свою успішність. Разом з цим, психолог має досить багато «паперової»
        роботи. Адже потрібно складати психологічні характеристики, обробляти
        отриманні данні, складати звіти. Друга, за сферою поширення, та не за
        важливістю галузь – кадрові агентства та консалтинг. Психолог також може
        успішно працювати у рекламних агентствах, входити до виборчого штабу,
        щоб допомогти скласти правильну стратегію впливу на споживача. Психологи
        затребувані у силових структурах, юриспруденції. Вони допомагають
        складати психологічний портер особи, здійснюють профвідбори та
        допомагають пройти соціальну реабілітацію для військових. Також психолог
        може займатися викладацькою діяльністю, проводити тренінги, здійснювати
        аналіз соціологічних опитувань, працювати у науково-дослідницьких
        центрах та лабораторіях. І це далеко не всі напрямки діяльності такого
        спеціаліста. Психолог та психотерапевт не працює з психічнохворими
        пацієнтами.
      </Text>
    </Container>
  );
};

export default PsychologistAbout;
