import React from 'react';
import { Container, Text, Button } from './webDesignLecture.styled';
import { Link } from 'react-router-dom';

const WebLecture = () => {
  return (
    <Container>
      <Link to={'/web'}>
        <Button type="button">Go back</Button>
      </Link>
      <Text>
        <b>Веб-сторінка та веб-сайт</b> Як зазначалося, найвідомішою та
        найпопулярнішою службою Інтернету є Всесвітня павутина (Веб). Саме після
        її розповсюдження став можливий масовий доступ користувачів до
        Всесвітньої мережі. Своєю появою Веб має завдячити Тіму Бернесу-Лі, який
        винайшов протокол HTTP, адреси URL та мову розмітки HTML — технології,
        на яких ґрунтується Веб. Служба Веб підтримується сукупністю серверів,
        які здатні обмінюватися даними за протоколом HTTP. Цих серверів
        мільйони, й розповсюджені вони по всьому світу. На них містяться
        веб-сторінки — спеціальні документи, створені з використанням мови
        розмітки HTML. Кожна веб-сторінка має адресу URL, за допомогою якої вона
        може бути знайдена. Перегляд веб-сторінок здійснюється у спеціальних
        програмах — браузерах, найпоширенішими з яких є Internet Explorer,
        Mozilla, Google Chrome, Opera та ін. Основною особливістю та перевагою
        веб-сторінок є те, що інформація на них організована як гіпертекст. Це
        текст, в який вбудовано спеціальні коди (теги), що керують такими
        додатковими елементами, як форматування, ілюстрації, мультимедійні
        вставки та гіпертек-стові посилання. Гіпертекстоее посилання
        (гіперпосилання, гіперзв'язок чи гі-перлінк) — це об'єкт веб-сторінки,
        що містить інформацію про адресу іншої веб-сторінки або про певне місце
        на поточній сторінці. Таким об'єктом може бути фрагмент тексту (зазвичай
        виділений кольором та підкресленням) або ілюстрація. У разі наведення на
        гіперпосилання вказівник миші набуває форми руки з витягнутим вказівним
        пальцем. Клацнувши лівою кнопкою миші, можна виконати перехід за
        гіперпосиланням. При цьому браузер завантажує веб-сторінку, яка
        міститься за адресою, зазначеною в посиланні. Ця веб-сторінка також може
        містити гіперпосилання, які вказують на інші веб-сторінки. Оскільки
        веб-сторінки можуть бути зв'язані між собою довільно, такий спосіб їх
        організації отримав назву Всесвітня павутина. Процес переходу в інші
        місця поточної веб-сторінки або до інших вебсторінок за допомогою
        гіперпосилань називають навігацією. Якщо після низки переходів за
        гіперпосиланнями необхідно повернутися на попередню сторінку, то
        користуються кнопкою «Назад» панелі інструментів браузера. Поруч із нею
        є стрілка для розкривання списку сторінок, що вже були переглянуті в
        цьому сеансі роботи; у списку можна вибрати потрібну сторінку і перейти
        до неї. Сукупність веб-сторінок, що тематично пов'язані між собою й
        розроблені як єдине ціле, називають веб-сайтом або просто сайтом.
        Сторінки веб-сайту розміщуються на одному сервері та мають однакову
        адресу сайту, наприклад http://bhv.kiev.ua/. Веб-сайт може надавати як
        пасивну інформацію, що читається лише 8 відвідувачем, так і активну, яку
        відвідувач може додавати або редагувати
      </Text>
      <Text>
        <b>Структура веб-сайтів</b> Зовнішній вигляд кожного сайту є унікальним,
        проте в усіх сайтів можна знайти спільні за функціональністю частини. На
        будь-якому сайті першою відкривається головна сторінка. її розробці
        приділяють особливу увагу, оскільки дослідження показали, що люди не
        здатні читати інформацію, що відображається на моніторі, так уважно, як
        книжки або журнали, вони зазвичай лише поверхово переглядають її,
        наприклад, як рекламу. Якщо головна сторінка містить те, що шукає
        відвідувач, він читає її далі, а якщо ні — переходить до інших сайтів,
        яких в Інтернеті дуже багато. У верхній частині головної сторінки
        зазвичай розташована так звана «шапка», яку дублюють на інших сторінках
        сайту. Це роблять спеціально, адже ця частина відображається у вікні
        браузера першою, і відвідувач насамперед звертає увагу на неї. Щоб
        забезпечити швидкий перехід до основних тематичних розділів сайту,
        створюють меню сайту — список гіперпосилань на його розділи.
        Горизонтальне меню зазвичай розташовують у шапці, іноді дублюючи його в
        нижній частині сторінки, а вертикальне — переважно в лівій частині
        сторінки, у місці, звідки відвідувач починає її переглядати. Меню є
        одним із найважливіших компонентів сайту, користувач постійно звертає на
        нього увагу, і тому вимоги до нього високі. Меню має бути зручним,
        помітним і зрозумілим, інакше користувач не знатиме, як потрапити в
        потрібний розділ, і вийде із сайту. Пункти меню мають бути чітко
        відділені один від одного.
      </Text>
      <Text>
        <b>Створення та підтримка веб-ресурсів</b> Для того щоб сайт став
        доступним широкому колу відвідувачів, йому необхідно призначити доменне
        ім'я і розмістити в мережі Інтернет. Розміщення сайту на сервері та
        подальше його адміністрування називають хостингом. Наданням такої
        послуги займаються спеціальні організації. Хостинг буває платний і
        безкоштовний. На серверах, що забезпечують хостинг, крім власне
        розміщення сайту зазвичай надається можливість створювати веб-сторінки
        та організовувати форуми і чати в автоматизованому режимі. Однією з
        найпростіших форм автоматизованого створення веб-ресурсів є блоги
        (онлайнові щоденники), які дають змогу публікувати та впорядковувати
        (зазвичай у хронологічному порядку) на веб-сторінках різноманітні
        записи. Зараз ви ознайомитеся з цими засобами створення й підтримки
        веб-ресурсів.
      </Text>
      <Text>
        <b>Структура мови HTML HTTP</b> - це протокол прикладного рівня,
        розроблений для обміну гіпертекстовою інформацією в мережі Internet.
        Протокол використовується в одному з найпопулярніших ресурсів мережі
        Internet - Word Wide Web - з 1990 року. Реальна інформаційна система
        вимагає набагато більшої кількості функцій, ніж просто пошук. HTTP
        дозволяє реалізувати в рамках обміну даними набір методів доступу, що
        базуються на специфікації універсального ідентифікатора ресурсів
        (Universal Resource Identifier), що застосовується у формі
        універсального локатора ресурсів (Universe Resource Locator) або
        універсального імені ресурсу (Universal Resource Name). Повідомлення в
        мережі при використанні протоколу HTTP передаються у форматі, подібному
        до формату поштового повідомлення Internet (RFC-822) або до формату
        повідомлень MIME (Multiperposal Internet Mail Exchange). HTTP
        використовується для взаємодії програм-клієнтів із програмами-шлюзами,
        що дозволяють доступ до ресурсів електронної пошти Internet (SMTP),
        списків новин (NNTP), файлових архівів (FTP), систем Gopher і WAIS.
        Протокол розроблений для доступу до цих ресурсів з допомогою проміжних
        програмсерверів (proxy), що дозволяють передавати інформацію між різними
        інформаційними службами без втрат. Протокол реалізує принцип
        "запит/відповідь". При роботі в Internet для обслуговування HTTP-запитів
        використовується 80 порт TCP/IP. В даний час у практиці World Wide Web
        реально використовуються тільки три методи доступу: POST, GET, HEAD. GET
        - метод, що дозволяє одержати дані, задані у формі URL в запиті ресурсу.
        Якщо посилаються на програму, то повертається результат виконання цієї
        програми, але не текст програми. Додаткові дані, які треба передати для
        обробки, кодуються в запит ресурсу. Існує різновид методу GET - умовний
        GET. При використанні цього методу сервер відповість на запит тільки в
        тому випадку, якщо будуть виконані умови передачі. Це дозволяє
        розвантажити мережу та позбавити її від передачі непотрібної інформації.
        Умова вказується в полі "if-Modified-Since" заголовка запиту. При
        використанні методу GET у поле тіла ресурсу повертається власне
        викликана інформація (текст HTMLдокумента, наприклад). HEAD - метод,
        аналогічний GET, але він не повертає тіло ресурсу. Використовується для
        одержання інформації про ресурс. Умовного HEAD не існує. Даний метод
        використовується для тестування гіпертекстових посилань. POST - цей
        метод, розроблений для передачі великого обсягу інформації на сервер.
        Ним користуються для анотування існуючих ресурсів, відсилання поштових
        повідомлень, роботи з формами інтерфейсів до зовнішніх баз даних і 13
        зовнішніх програм, що виконуються. У відмінності від GET і HEAD, у POST
        передається тіло ресурсу, що і є інформацією з поля чи форм, або інших
        джерел уведення. У перших версіях протоколу були визначені й інші методи
        доступу (DELETE, наприклад), але вони не знайшли належного застосування.
        Багато функцій, що покладали на ці методи, можна успішно виконувати
        через POST.
      </Text>
      <Text>
        <b>Робота з Web-кольорами</b> Професіонали звичайно задають кольори як
        шістнадцяткові значення з 216-колірної Web-палітри. Дивний ефект
        "зникнення" тексту вийде в тому випадку, якщо зробити однаковими колір
        активного зв’язку і колір фону. Після натиснення на зв’язку і повернення
        на основну сторінку, зв’язок знову стане темно-сірим.
      </Text>
    </Container>
  );
};

export default WebLecture;
