import React from 'react';
import { Container, Button, Text, Img } from './SecretaryAbout.styled';
import { Link } from 'react-router-dom';
import secretary from '../../../images/Secretary/secretaryAbout.png';

const SecretaryAbout = () => {
  return (
    <Container>
      <Link to={'/secretary'}>
        <Button type="button">Go back</Button>
      </Link>
      <Img src={secretary} alt="Secretary" />
      <Text>
        Професія <b>секретаря керівника</b> відіграє важливу роль у сучасних
        організаціях та підприємствах. Цей фахівець виконує ряд ключових
        завдань, спрямованих на підтримку ефективного функціонування організації
        та забезпечення високого рівня робочої продуктивності. Основні обов'язки
        секретаря керівника включають: Організаційні функції: Керування
        розкладом та графіком роботи керівника. Планування та організація
        зустрічей, нарад, конференцій. Забезпечення належної підготовки
        документації для зустрічей. Листування та комунікації: Складання та
        відправлення листів, електронних повідомлень від імені керівника.
        Здійснення телефонного та письмового контакту з партнерами, клієнтами та
        іншими представниками організації. Документообіг: Підготовка, реєстрація
        та зберігання документів. Ведення бази даних та архівування необхідної
        інформації. Підтримка прийняття рішень: Забезпечення керівника
        необхідною інформацією для прийняття рішень. Підготовка звітів та
        презентацій за дорученням керівника. Проведення переговорів: Підготовка
        необхідної інформації для переговорів та підтримка під час їх
        проведення. Секретарська підтримка: Забезпечення зручних умов для роботи
        керівника (організація робочого простору, надання необхідних
        матеріалів). Виконання інших пов'язаних з секретарем завдань за
        дорученням керівника. Конфіденційність та дискретність: Збереження
        конфіденційності інформації, що стосується діяльності керівника та
        організації в цілому. Вміння працювати в електронних системах: Знання
        офісних програм, електронної пошти та інших інструментів для ефективної
        роботи. Комунікаційні навички: Високий рівень комунікативності та вміння
        ефективно спілкуватися з різними групами людей. Секретар керівника
        володіє важливими організаційними та міжособистісними вміннями, що
        дозволяють забезпечити плавне функціонування офісу та підтримувати
        керівника в досягненні стратегічних цілей організації. Ця професія
        вимагає від спеціаліста великої відповідальності, дисциплінованості та
        вміння працювати в умовах високого темпу.
      </Text>
    </Container>
  );
};

export default SecretaryAbout;
