import React from 'react';
import { Container, Text, Button } from './SecretaryLecture.styled';
import { Link } from 'react-router-dom';

const SecretaryLecture = () => {
  return (
    <Container>
      <Link to={'/secretary'}>
        <Button type="button">Go back</Button>
      </Link>
      <Text>
        <b>Секретар: обов’язки, функції, можливості, вимоги, класифікація.</b>
        Секретарі з'явилися в Стародавньому Римі як охоронці чужих секретів.
        Потім з секретарів виділилися нотаріуси. А самі секретарі з довірених
        осіб королів, царів, герцогів і перів поступово перетворилися в
        діловодів. Традиційно в ролі секретарів виступали чоловіки. І тільки в
        кінці 18 століття з'явилися жінки-секретарі. Можливості
        секретаря-референта. Секретар це обличчя фірми. Він перший, з ким
        стикається відвідувач, що прийшов в установу, перший, з ким
        зустрічається, починаючи свій трудовий день керівник, перший, хто
        відповідає на телефонні дзвінки. Від поведінки секретаря багато в чому
        залежить не тільки престиж фірми, в якій він трудиться, але часом і
        успіх партнерів і клієнтів фірми. Секретар повинен бути завжди в
        «формі»: ретельно і продумано одягнутий, охайний, готовий швидко і
        кваліфіковано виконати дані йому доручення., уміти спокійно, без
        розгубленості, різкості, суєти і з достоїнством вирішувати питання в
        рамках своєї компетенції. Йому необхідний дар відчувати «нюанс» справи,
        що дозволяє вільно виходити з скрутних ситуацій, зокрема, не бачити і не
        чути того, чого не треба бачити або чути. Секретар завжди повинен бути
        на насторожі і в курсі багатьох справ: вести роботу з документами, брати
        участь в проведенні ділових зустрічей і переговорів, відповідати на
        телефонні дзвінки і сам робити розпорядження за дорученням керівництва,
        здійснювати запис відвідувачів на прийом. Але іноді доводиться робити і
        разові доручення, наприклад, передачу грошей, міжміську телефонну
        розмову, відвідувати хворого товариша по службі і так далі. Через
        секретаря здійснюється зв'язок керівника з підлеглими і зовнішніми
        світом. Здатність орієнтуватися в складному різноманітному потоку
        інформації, правильно, чітко і оперативно класифікувати її часто
        визначає оперативність роботи відділів і навіть всієї установи. Основні
        функції секретаря. Важливу роль грає професійна базова підготовка, що
        включає як високий рівень загальної освіти, так і специфічні знання, які
        можуть бути визначені відповідно до основних функцій секретаря: знання,
        необхідні для ефективної участі в інформаційно-документарному
        забезпеченні фірми і безпосередньо керівника (володіння такими
        технічними засобами, як персональний комп'ютер, телефон, факс, ксерокс);
        знання, пов'язані з основними напрямами діяльності фірми, її внутрішньою
        структурою і зовнішніми зв'язками; знання правових актів і додатків, що
        регламентують роботу фірми і її співробітників; знання, що вимагаються
        для комунікативного забезпечення роботи фірми і її адміністрації; вони
        необхідні секретареві при підготовці нарад і прийомі відвідувачів, при
        діловій переписці і ділових переговорах, при плануванні свого робочого
        дня і обслуговуванні співробітників фірми. Сучасні вимоги. Щоб
        відповідати сучасним вимогам, секретар повинен володіти наступними
        якостями: мати професійний імідж; добре володіти мовою і письмом;
        володіти хорошою пам'яттю; добре орієнтуватися у часі; тримати в порядку
        документацію, швидко знаходити необхідні папери; уміти красиво оформляти
        звіти, вести ділову переписку керівника; освоювати розробки новітніх
        комп'ютерних програм для офісу; бути енергійним, проявляти ініціативу;
        швидко знаходити взаєморозуміння з колегами і клієнтами; підтримувати
        ефективну роботу офісу у відсутності шефа; контролювати фінанси офісу;
        бути обачним в конфіденційних, делікатних питаннях фірми. Класифікація
        секретарів. Є декілька позицій, які займають секретарі. RECEPTIONIST -
        дівчина, працююча на телефоні. У її обов'язку входить відповідати на
        питання, зустрічати і проводжати гостей і клієнтів. На цій посаді
        необов'язкове знання іноземної мови. Основна вимога уміння триматися і
        акуратність. На цьому ж рівні знаходиться посада інформатора. Тільки в
        цьому випадку дівчина повідомляє клієнтам якусь конкретну інформацію.
        Якщо людина володіє іноземною мовою, йому передбачена посада OFFICE
        MENEGER, який займається організацією офісу. Сама ж висока посада
        PERSONAL SEKRETARY помічник генерального директора або президента. У
        цьому випадку дівчина працює тільки на одного шефа, відповідає на
        кореспонденцію як на українській, так і на англійських мовах,
        супроводить директора у відрядження. Тут велика увага приділяється
        зовнішнім даним, акуратності, організованості, виконавчості. Такий
        секретар повинен бути не тільки виконавцем, але і ініціатором. Знати, що
        відповісти, як зорієнтуватися в будь-якій ситуації. Але і це не межа.
        Можна вирости з секретаря в менеджери. Специфіка і складність роботи
        секретаря пов'язана з тим, що вона завжди на очах, в центрі спілкування
        з керівництвом, колегами, клієнтами. Він як би безліччю ниточок зв'язує
        різні підрозділи фірми, знаходиться в центрі внутрішніх проблем і її
        зовнішніх контактів. Тому роль секретаря в ритмічному ефективному
        функціонуванні фірми, в створенні психологічного клімату в колективі
        надзвичайно важлива і не замінима. Обов'язки. Без особливого роду знань,
        умінь і навичок секретареві не справиться зі своїми обов'язками. А в
        обов'язки входить: облік, реєстрація, розгляд і підготовка поступаючої
        кореспонденції для доповіді керівництву; оформлення (в тому числі
        друкування) і розсилка розподільних документів, листів, телеграм,
        телефонограм, факсів, і т. п.; підготовка по вказівці керівника і
        узгодження зі структурними підрозділами проектів окремих наказів,
        довідок, листів, відрядних посвідчень і інших документів; оформлення
        протоколів розсилок виписок з них; аналіз довідок і доповідей
        структурних підрозділів з висновками і пропозиціями по них; підготовка і
        своєчасна розсилка матеріалів до засідань, нарад, конференцій, семінарів
        і з'їздів; прийом і реєстрація заяв, пропозицій і скарг від громадян;
        організація прийомів відвідувачів; прийом, реєстрація, зберігання,
        облік, доставка по підрозділах і розсилка поступаючої, вихідної і
        внутрішньої кореспонденції, підготовка справ до здачі на державне
        зберігання і у внутрішній архів фірми. Крім роботи з документами в
        обов'язку секретаря включаються функції по бездокументарному
        обслуговуванню. Зокрема: технічне забезпечення роботи керівника;
        підготовка і організація матеріально-технічного забезпечення засідань,
        нарад; організація прийому працівників і відвідувачів; телефонне
        обслуговування; підготовка відряджень; організація презентацій і
        спеціальних прийомів гостей; стенографування; контроль за святковими і
        ювілейними датами; обробка пошти; машинописні роботи; збір ділової
        інформації і її реферування по завданню директора; збір матеріалів для
        доповідей і мов керівника; ведення табеля обліку робочого часу і т.д.
        Перераховані службові обов'язки можуть бути обмежені і доповнені іншими.
        Але і приведений перелік дає уявлення про специфіку секретарської
        роботи, в зв'язку з чим доречно розглянути головні аспекти професійної
        діяльності і культури праці секретаря. Особливістю роботи також є
        постійна недостача часу, робота в умовах стресу. У цьому випадку виручає
        уміння слухати, правильно розуміти, запам'ятовувати завдання. Оцінювати
        і ухвалювати швидкі і вірні рішення. Висновок. Пам'ятайте: ваші помилки
        це помилки тієї посадової особи, в структурному підрозділі якого ви
        працюєте. Приступаючи до роботи, дайте відповідь собі на наступні
        питання: Що треба зробити? Як? Коли? Який очікуваний результат? Небагато
        роздуму, трішки здорового глузду, оперативності і все готове. Якщо ви
        цілеспрямована і організована, ділова, доброзичлива в спілкуванні з
        оточуючими і приваблива, то професія секретар чекає вас.
      </Text>
      <Text>
        <b>ОРГАНІЗАЦІЯ РОБОТИ З ДОКУМЕНТАМИ</b> Документообіг – це рух
        документів в установі з моменту їх створення або підписання до виконання
        або відправлення. У документообігу установи розрізняють такі потоки
        документів: - вхідні (що надходять); - вихідні (відсилаються); -
        внутрішні (створені і циркулюють в установі). Обсяг документообігу
        визначається кількістю вхідних, вихідних і внутрішніх документів за
        певний період, як правило за рік. Окремо враховують копії документів. За
        обсягом документообігу установи поділяються на 4 категорії: - І – обсяг
        документообігу установи складає від 100 тис. документів на рік; - ІІ -
        обсяг документообігу установи складає від 25 до 100 тис. документів; -
        ІІІ - обсяг документообігу установи складає від 10 до 25 тис.
        документів; - ІУ - обсяг документообігу установи складає до 10 тис.
        документів. В канцелярії установи щомісяця складається зведення про
        обсяг документообігу. Облік документообігу здійснюється з метою
        одержання даних для розрахунку штатного розкладу, для розподілу роботи
        між структурними підрозділами і окремими виконавцями, для вибору
        технічних засобів при механізації діловодних процесів. Етапи
        документообігу Робота з документами, що надходять до установ,
        складається з ряду послідовних операцій: приймання, експедиційна
        обробка, попереднє розглядання, розподіл, реєстрація, виконання,
        контроль за виконанням, відправлення. Приймання та експедиційна обробка
        Здійснюється секретарем або призначеною особою (установи ІУ кат.), або у
        спеціальному підрозділі, наприклад, в експедиції (установи ІІ –І
        категорій). Централізація цього процесу прискорює доставку документів до
        місця їх виконання. Експедиційна обробка: - спочатку перевіряють
        вірність доставлення документа, цілісність вкладення; якщо виявлено
        пошкодження конверту – відповідну позначку у поштовому реєстрі; -
        перевіряють відповідність номерів на конверті і документах. У разі
        відсутності документа складається акт у 2-х примірниках: 1 –
        відправнику; 2 – до канцелярії; - незасвідчені документи, надіслані не
        за адресою повертаються відправнику чи пересилаються за приналежністю -
        фіксують факт надходження документа за допомогою реєстраційного штампу
        (реквізит 30). Конверти зберігаються у таких випадках: - для
        встановлення адреси відправника; - для підтвердження дати надходження
        документа за допомогою поштового штемпеля; - документ має особистий
        характер, а надпис “особисто” відсутній; - коли відсутні окремі
        документи чи номери документів не відповідають номерам на конвертах.
        Попереднє розглядання та розподіл Мета: розподіл на ті, що потребують
        обов’язкового розгляду керівником чи виконавцями, визначення їх
        реєстрації, встановлення терміну виконання. Із експедиції документи, що
        надійшли на адресу керівника, передаються до секретаріатів, документи,
        адресовані установі – до канцелярії, інші – до структурних підрозділів.
        На розгляд керівника передаються документи, що надійшли від установ
        влади, газет, журналів та інші документи, що потребують рішення
        керівника. Реєстрація документів Використовується для обліку, контролю,
        подальшого пошуку документа. Реєстрація – це фіксація факту створення
        або надходження документа шляхом надання йому умовного позначення –
        реєстраційного індексу (номеру). (Див. рев. 11) При індексації заяв,
        скарг, пропозицій громадян перша пара цифр індексу може позначати першу
        букву прізвища заявника, наприклад, 03-24-186, де: 03 – прізвище на
        букву «В» (Волков) Головний принцип реєстрації – однократність –
        документ реєструється один раз у межах груп. Вхідні документи
        реєструються у день їх надходження або не пізніше наступного дня, якщо
        документ надійшов у неробочий час, вихідні – у день їх підписання
        керівником, внутрішні – у день підписання, затвердження. Не
        реєструються: вітальна кореспонденція, телеграми, проекти, реклама,
        первісні документи бухгалтерської та статистичної звітності та обліку,
        малозначне листування з питань адміністративно-господарчої частини.
        Форми реєстрації документів: карткова та журнальна, автоматизована РКК
        заповнюється у 2-х і більше примірниках (або за необхідністю – за
        кількістю виконавців): І – до реєстраціно-контрольної картотеки; ІІ та
        ін. – у виконавців. Автоматизована система реєстрації здійснюється з
        реєстраційно-контрольної картки, складеної на базі обов’язкових
        реквізитів реєстрації або шляхом прямого вводу з документа реквізитів
        реєстрації. Обов’язкові реквізити реєстрації: (див. формуляр РКК). За
        автоматизованої реєстрації формується банк реєстраційних даних.
        Розглядання та виконання документів Документи, що надійшли,
        розглядаються у день їх надходження. Доручення вищих органів, телеграми,
        телефонограми необхідно розглядати негайно. На документах, які розглядає
        керівник, він ставить резолюцію (реквізит 17). Не рекомендується ставити
        резолюцію на окремих аркушах, але є такі документи, наприклад, статути
        великих підприємств, закони, укази, постанови та розпорядження, на яких
        резолюції і візи ставляться на окремих аркушах. Після розглядання
        документ повертається до канцелярії (секретаря), де він додатково
        реєструється (переноситься до форми реєстрації резолюція), а потім
        направляється до виконавця. На документах, що не відправляються
        (внутрішніх), а також на тих, на які не дається відповідь, робиться
        відмітка: “Виконано”, “Прийнято до керування”, “Включено до плану” або
        “Включено до звіту” тощо.
      </Text>
    </Container>
  );
};

export default SecretaryLecture;
