import{s as t,j as o,L as i}from"./index-dafcac76.js";const e=t.button`
  text-decoration: none;
  margin: 0 6px;
  color: white;
  transition: all 0.2s cubic-bezier(0.645, 0.045, 0.355, 1);
  border: 1px solid #1677ff;
  border-radius: 2px;
  box-shadow: 0 2px 0 rgb(5 145 255 / 10%);
  padding: 2px 8px;
  background-color: #1677ff;
  font-weight: 400;
  font-size: 18px;

  &:hover,
  &:focus {
    opacity: 0.8;
    background-color: white;
    color: #1677ff;
  }
`,n=t.p`
  margin-top: 20px;
  margin-bottom: 20px;
  font-size: 18px;
  line-height: 1.22;
  text-align: justify;
  text-indent: 30px;
  line-height: 1.3;
`,s=t.img`
  width: 300px;
  object-fit: contain;
  object-position: center;
  display: flex;
  margin: 0 auto;
`,r=t.div`
  width: 1280px;
  padding: 32px 16px;
  margin: 0 auto;
`,c="/mnvk/assets/cookAbout-e4984e36.png",a=()=>o.jsxs(r,{children:[o.jsx(i,{to:"/cook",children:o.jsx(e,{type:"button",children:"Go back"})}),o.jsx(s,{src:c,alt:"Cook"}),o.jsxs(n,{children:[o.jsx("b",{children:"Кухар"})," - це людина, яка займається приготуванням їжі. Кухарів ще називають кулінарами. Слово «кулінарія» виникло від латинського слова «culina» (кухня). Українська кухня з давніх-давен відзначалась різноманітністю страв з високими смаковими і поживними якостями. Приготування їжі виділилось в окрему спеціальність при княжих дворах та монастирях. Так вже в XI столітті в Києво-Печерському монастирі серед ченців було кілька кухарів. Кухарі могли створювати репутації знатних будинків і навіть цілих держав. Сьогодні кухар не в меншій мірі може впливати на дійсність. Будучи тонким знавцем своєї справи, кухар може змінити настрій гостей прославити те чи інше ім'я, створити той чи інший ресторанний бренд."]}),o.jsxs(n,{children:[o.jsx("b",{children:"Характер роботи"})," Технологічний процес приготування їжі складається з кількох стадій та операцій. Кухар, насамперед, виконує такі операції: Untitled 1прийом сировини, її переробка, зберігання продуктів; приготування холодних закусок, гарячих страв та напоїв, борошняних виробів; оформлення страв та їх роздача. Основні операції кухар виконує вручну. Але сьогодні вже більшість трудомістких операцій здійснюють машини, механізми та автомати. На кухні кухар ніби губиться серед численних приладів, механічного, теплового та холодильного устаткування. Кухар повинен мати хороший загальний інтелект, добре розвинені дотик та нюх; координацію рухів рук; високі показники концентрації, переключення, стійкості та об'єму уваги; добре розвинену довготривалу, мовно-логічну, зорову, образну, оперативну пам'ять. Умови роботи Праця кухаря належить до розряду фізичної праці середньої тяжкості. Кухарем можуть працювати як жінки, так і чоловіки різного віку. Чітка організація праці на підприємстві, раціональне використання робочої сили значною мірою залежать від дотримання працівником режиму праці і відпочинку, графіка роботи. Планування робочого місця передбачає зручність виконання роботи, економію робочих рухів, виробничої площі, ефективність обслуговування. В кухарській справі головне - талант, почуття смаку, фантазія. Професія вимагає скрупульозної точності, наявності творчої жилки, щоб придумати оригінальний рецепт або вишукано прикрасити страву. Нюх і тонкі смакові відчуття допоможуть кухареві досягти висот у кар'єрі. Хороший кухар повинен бути уважним, акуратним, організованим, мати хорошу пам'ять."]})]});export{a as default};
