import{s as o,j as t,L as i}from"./index-a93901b7.js";const n=o.button`
  text-decoration: none;
  margin: 0 6px;
  color: white;
  transition: all 0.2s cubic-bezier(0.645, 0.045, 0.355, 1);
  border: 1px solid #1677ff;
  border-radius: 2px;
  box-shadow: 0 2px 0 rgb(5 145 255 / 10%);
  padding: 2px 8px;
  background-color: #1677ff;
  font-weight: 400;
  font-size: 18px;

  &:hover,
  &:focus {
    opacity: 0.8;
    background-color: white;
    color: #1677ff;
  }
`,r=o.p`
  margin-top: 20px;
  margin-bottom: 20px;
  font-size: 18px;
  line-height: 1.22;
  text-align: justify;
  text-indent: 30px;
  line-height: 1.3;
`,e=o.img`
  width: 450px;
  object-fit: contain;
  object-position: center;
  display: flex;
  margin: 0 auto;
`,s=o.div`
  width: 1280px;
  padding: 32px 16px;
  margin: 0 auto;
`,x="/mnvk/assets/driverAbout-b6e49498.png",c=()=>t.jsxs(s,{children:[t.jsx(i,{to:"/driver",children:t.jsx(n,{type:"button",children:"Go back"})}),t.jsx(e,{src:x,alt:"Driver"}),t.jsxs(r,{children:[t.jsx("b",{children:"Водій"})," автотранспортних засобів – фахівець, який професійно управляє легковими і вантажними автомобілями всіх типів і марок, а також машинами спеціального призначення. Коротка історія професії Слово “автомобіль” – коляска самопересувна (вуатюоотомобіль) – так називався перший екіпаж з механічним двигуном. З часом, від цієї назви залишилося тільки слово “отомобіль”, яке бере свій початок від грецьких “ауто” (сам) і латинського “мобіліс” (той, що рухається). Саме ці два слова породили звичне для наших вух “автомобіль” і “авто”. Перші автомобілі були звичайними каретами і колясками, тільки без віжок і з бензиновим двигуном, який заміняв коней. У конструкції автомобіля і до цього дня збереглося багато чого від коляски, звичайно в сильно зміненому вигляді: колеса, осі, ресори, рама, кузов, гальма та інші вузли. Перші автомобілі були відкритими, і, щоб захиститися від вітру, дощу, пилу і бруду, автомобілісти надягали шуби, шкіряні шоломи і великі окуляри. Вітрове скло з’явилося пізніше, і лише через деякий проміжок часу став нормою засклений закритий кузов для пасажирів. У сучасному світі автомобіль – не тільки найпопулярніший засіб пересування, але й індивідуальний транспортний засіб, який дозволяє його власникові бути достатньо мобільним для досягнення як особистих, так і професійних цілей. Характер роботи. Для водія характерне поняття “робоче місце” – автомобіль і “робоча зона” – дорога, АТП, АЗС і т.п. Робоче місце – автомобіль є місцем підвищеної небезпеки. Професія водія автотранспортних засобів – актуальна на ринку праці Прикарпаття, щорічно тисячі молодих людей поповнюють ряди професіоналів. Автомобільний транспорт займає провідне місце, він використовується для перевезення людей і доставки вантажів, використовується і великими підприємствами, і приватними підприємцями. Водій автотранспортного засобу повинен знати призначення, розташування, принцип дії механізмів і приладів легкового і вантажного автомобіля. Крім того, він повинен дотримуватися правил техніки безпеки при перевірці технічного стану автомобіля в обігу з експлуатаційними матеріалами: паливом, електролітом, маслами, охолоджувальними рідинами."]})]});export{c as default};
