import{s as o,j as t,L as i}from"./index-f523ec91.js";const n=o.button`
  text-decoration: none;
  margin: 0 6px;
  color: white;
  transition: all 0.2s cubic-bezier(0.645, 0.045, 0.355, 1);
  border: 1px solid #1677ff;
  border-radius: 2px;
  box-shadow: 0 2px 0 rgb(5 145 255 / 10%);
  padding: 2px 8px;
  background-color: #1677ff;
  font-weight: 400;
  font-size: 18px;

  &:hover,
  &:focus {
    opacity: 0.8;
    background-color: white;
    color: #1677ff;
  }
`,s=o.p`
  margin-top: 20px;
  margin-bottom: 20px;
  font-size: 18px;
  line-height: 1.22;
  text-align: justify;
  text-indent: 30px;
  line-height: 1.3;
`,e=o.img`
  width: 450px;
  object-fit: contain;
  object-position: center;
  display: flex;
  margin: 0 auto;
`,r=o.div`
  width: 1280px;
  padding: 32px 16px;
  margin: 0 auto;
`,c="/mnvk/assets/locksmithAbout-afe4641d.png",x=()=>t.jsxs(r,{children:[t.jsx(i,{to:"/locksmith",children:t.jsx(n,{type:"button",children:"Go back"})}),t.jsx(e,{src:c,alt:"Locksmith"}),t.jsxs(s,{children:["Професія ",t.jsx("b",{children:"слюсаря"})," дуже поширена та необхідна для будь-яких видів і етапів виробництва, де є техніка, механізми, прилади, агрегати. Це кваліфікований робітник, який обслуговує техніку на підприємствах або вдома, регулює, виконує поточний і терміновий ремонти, проводить профілактичні заходи. Сучасне виробництво повністю механізоване. Без техніки, різноманітних механізмів і пристосувань неможливо побудувати будинок, посіяти хліб. Усе промислове виробництво засноване на застосуванні техніки, яка полегшує, а часом й цілком замінює людську працю. Навіть хатня робота нині неможлива без побутової техніки - пральних машин, кухонних комбайнів. Вся техніка, як виробнича, так і побутова потребує догляду, профілактичних заходів, ремонту, обслуговування. Переоцінити важливість професії слюсаря-ремонтника, який здійснює всі ці функції, складно, адже він забезпечує безперебійну роботу усього виробництва. Слюсар-ремонтник - професія дуже розповсюджена. Проте, оскільки, ці фахівці потрібні для різних видів виробництва, є вузька спеціалізація слюсарів, підготовка та навчання яких ведеться саме для тієї галузі, де вони будуть працювати. Слюсар-ремонтник займається монтажем, налагодженням, регулюванням і діагностуванням механізмів. Після виявлення проблеми він проводить ремонт, заміну зламаних деталей, монтаж нових. Поточний профілактичний ремонт передбачає чищення та змащування вузлів і агрегатів, заміну деталей з терміном придатності, якій закінчився. Слюсар-ремонтник розбирає несправні вузли, замінює чи виготовляє окремі деталі, збирає, регулює, випробовує на холостому ходу, змащує . Він повинен слідкувати за технічним станом обладнання, що знаходиться в його сфері обслуговування, здійснювати постійні технічні огляди, усувати дрібні неполадки, проводити поточні і капітальні ремонти обладнання."]})]});export{x as default};
