import{s as o,j as t,L as i}from"./index-7520cba2.js";const n=o.button`
  text-decoration: none;
  margin: 0 6px;
  color: white;
  transition: all 0.2s cubic-bezier(0.645, 0.045, 0.355, 1);
  border: 1px solid #1677ff;
  border-radius: 2px;
  box-shadow: 0 2px 0 rgb(5 145 255 / 10%);
  padding: 2px 8px;
  background-color: #1677ff;
  font-weight: 400;
  font-size: 18px;

  &:hover,
  &:focus {
    opacity: 0.8;
    background-color: white;
    color: #1677ff;
  }
`,e=o.p`
  margin-top: 20px;
  margin-bottom: 20px;
  font-size: 18px;
  line-height: 1.22;
  text-align: justify;
  text-indent: 30px;
  line-height: 1.3;
`,s=o.img`
  width: 650px;
  object-fit: contain;
  object-position: center;
  display: flex;
  margin: 0 auto;
`,r=o.div`
  width: 1280px;
  padding: 32px 16px;
  margin: 0 auto;
`,a="/mnvk/assets/webAbout-69d5afc3.png",c=()=>t.jsxs(r,{children:[t.jsx(i,{to:"/web",children:t.jsx(n,{type:"button",children:"Go back"})}),t.jsx(s,{src:a,alt:"Web"}),t.jsxs(e,{children:[t.jsx("b",{children:"Веб-дизайнер"})," — це фахівець в IT, який у команді робить сайти та мобільні додатки. Він малює лендінги, багатосторінкові сайти, макети інтернет-магазинів і веб-додатків. Оформлення Netflix або сайту Rozetka — робота веб-дизайнера. Уявімо, що сайт — це вітрина. Завдання веб-дизайнера — зробити так, щоб ця вітрина була зручною, цікавою і корисною. Розглянемо на прикладах. Веб-дизайнер — архітектор для сайтів. Він придумує розташування елементів і кольору, картинки — так, щоб це було зручно відвідувачам сайту. А власник сайту отримував вигоду від продукту: клієнти знаходять потрібний товар, сторінку блогу або можуть прочитати важливий текст на кшталт вигод покупки. Він не програмує, а створює архітектуру. Якщо говорити простіше — малює картинку сайту. Далі програміст за допомогою коду переносить картинку на робочий сайт. Додатково налаштовує товари, кнопки, посилання та інші інтерактивні елементи. Головне для фахівця — дизайн у веб-середовищі: робота з сайтами, сервісами, додатками. Решту потрібно знати в основах. Не потрібно писати рекламні тексти або досконально верстати сайти. Досить пройти вступні курси, щоб розібратися у сфері та правилах. Копірайтеру підкажете, де тексту багато і він не поміститься. А недосвідченому верстальнику — як перенести блок або кнопку, якщо не виходить. Професійні навички можна освоїти під час навчання і практики: Редактори для дизайну. Найкращий — Figma. На то є дві причини: у ньому показує готовий код стилів для верстальника, і редактор робили для вебпроєктів: налаштування для макетів, перенесення картинок у два кліки, робота на одній сторінці в команді. Додатково дизайнери вчать графічні та фоторедактори, наприклад Adobe Illustrator або Photoshop. Основи дизайну: композиції, перспективи, типографіки та кольорова палітра. Основи дизайну інтерфейсів (UX і UI-дизайн) — розуміти, куди на сайтах розміщувати елементи і чому це правильно, зручно і корисно для відвідувачів. Основи анімації — зараз популярні сайти з ефектами, на кшталт мерехтливих кнопок, спливаючого тексту або рухомих картинок. Їх може зробити і веб-дизайнер."]})]});export{c as default};
