import React from 'react';
import { Container, Button, Text, Img } from './DriverAbout.styled';
import { Link } from 'react-router-dom';
import driver from '../../../images/Driver/driverAbout.png';

const DriverAbout = () => {
  return (
    <Container>
      <Link to={'/driver'}>
        <Button type="button">Go back</Button>
      </Link>
      <Img src={driver} alt="Driver" />
      <Text>
        <b>Водій</b> автотранспортних засобів – фахівець, який професійно
        управляє легковими і вантажними автомобілями всіх типів і марок, а також
        машинами спеціального призначення. Коротка історія професії Слово
        “автомобіль” – коляска самопересувна (вуатюоотомобіль) – так називався
        перший екіпаж з механічним двигуном. З часом, від цієї назви залишилося
        тільки слово “отомобіль”, яке бере свій початок від грецьких “ауто”
        (сам) і латинського “мобіліс” (той, що рухається). Саме ці два слова
        породили звичне для наших вух “автомобіль” і “авто”. Перші автомобілі
        були звичайними каретами і колясками, тільки без віжок і з бензиновим
        двигуном, який заміняв коней. У конструкції автомобіля і до цього дня
        збереглося багато чого від коляски, звичайно в сильно зміненому вигляді:
        колеса, осі, ресори, рама, кузов, гальма та інші вузли. Перші автомобілі
        були відкритими, і, щоб захиститися від вітру, дощу, пилу і бруду,
        автомобілісти надягали шуби, шкіряні шоломи і великі окуляри. Вітрове
        скло з’явилося пізніше, і лише через деякий проміжок часу став нормою
        засклений закритий кузов для пасажирів. У сучасному світі автомобіль –
        не тільки найпопулярніший засіб пересування, але й індивідуальний
        транспортний засіб, який дозволяє його власникові бути достатньо
        мобільним для досягнення як особистих, так і професійних цілей. Характер
        роботи. Для водія характерне поняття “робоче місце” – автомобіль і
        “робоча зона” – дорога, АТП, АЗС і т.п. Робоче місце – автомобіль є
        місцем підвищеної небезпеки. Професія водія автотранспортних засобів –
        актуальна на ринку праці Прикарпаття, щорічно тисячі молодих людей
        поповнюють ряди професіоналів. Автомобільний транспорт займає провідне
        місце, він використовується для перевезення людей і доставки вантажів,
        використовується і великими підприємствами, і приватними підприємцями.
        Водій автотранспортного засобу повинен знати призначення, розташування,
        принцип дії механізмів і приладів легкового і вантажного автомобіля.
        Крім того, він повинен дотримуватися правил техніки безпеки при
        перевірці технічного стану автомобіля в обігу з експлуатаційними
        матеріалами: паливом, електролітом, маслами, охолоджувальними рідинами.
      </Text>
    </Container>
  );
};

export default DriverAbout;
