import React from 'react';
import { Container, Button, Text, Img } from './LocksmithAbout.styled';
import { Link } from 'react-router-dom';
import locksmith from '../../../images/Locksmith/locksmithAbout.png';

const LocksmithAbout = () => {
  return (
    <Container>
      <Link to={'/locksmith'}>
        <Button type="button">Go back</Button>
      </Link>
      <Img src={locksmith} alt="Locksmith" />
      <Text>
        Професія <b>слюсаря</b> дуже поширена та необхідна для будь-яких видів і
        етапів виробництва, де є техніка, механізми, прилади, агрегати. Це
        кваліфікований робітник, який обслуговує техніку на підприємствах або
        вдома, регулює, виконує поточний і терміновий ремонти, проводить
        профілактичні заходи. Сучасне виробництво повністю механізоване. Без
        техніки, різноманітних механізмів і пристосувань неможливо побудувати
        будинок, посіяти хліб. Усе промислове виробництво засноване на
        застосуванні техніки, яка полегшує, а часом й цілком замінює людську
        працю. Навіть хатня робота нині неможлива без побутової техніки -
        пральних машин, кухонних комбайнів. Вся техніка, як виробнича, так і
        побутова потребує догляду, профілактичних заходів, ремонту,
        обслуговування. Переоцінити важливість професії слюсаря-ремонтника, який
        здійснює всі ці функції, складно, адже він забезпечує безперебійну
        роботу усього виробництва. Слюсар-ремонтник - професія дуже
        розповсюджена. Проте, оскільки, ці фахівці потрібні для різних видів
        виробництва, є вузька спеціалізація слюсарів, підготовка та навчання
        яких ведеться саме для тієї галузі, де вони будуть працювати.
        Слюсар-ремонтник займається монтажем, налагодженням, регулюванням і
        діагностуванням механізмів. Після виявлення проблеми він проводить
        ремонт, заміну зламаних деталей, монтаж нових. Поточний профілактичний
        ремонт передбачає чищення та змащування вузлів і агрегатів, заміну
        деталей з терміном придатності, якій закінчився. Слюсар-ремонтник
        розбирає несправні вузли, замінює чи виготовляє окремі деталі, збирає,
        регулює, випробовує на холостому ходу, змащує . Він повинен слідкувати
        за технічним станом обладнання, що знаходиться в його сфері
        обслуговування, здійснювати постійні технічні огляди, усувати дрібні
        неполадки, проводити поточні і капітальні ремонти обладнання.
      </Text>
    </Container>
  );
};

export default LocksmithAbout;
