import React from 'react';
import { Container, Text, Button } from './PsychologistLecture.styled';
import { Link } from 'react-router-dom';

const PsychologistLecture = () => {
  return (
    <Container>
      <Link to={'/psychologist'}>
        <Button type="button">Go back</Button>
      </Link>
      <Text>
        <b>Діяльності як форми активності людини </b> Поняття діяльності у
        психології розглядається як зовнішня (фізична) та внутрішня (психічна)
        активність людини, що регулюється свідомою метою. Діяльність як форма
        активності притаманна лише людині та протистоїть так званій імпульсивній
        поведінці, що регулюється емоціями. В цілому активність – риса, що
        характерна для всього живого. Джерелом активності є потреби. Потреба –
        це відповідний стан, що відбиває залежність від конкретних умов
        існування та породжує активність до цих умов. Саме активність забезпечує
        постійне підтримання життєво важливих зв`язків з оточуючим середовищем.
        Потреби тварин безпосередньо пов`язані з природою. Потреби людей
        змінювалися протягом століть, а також індивідуально протягом життя
        кожної людини. У людей і тварин є спільні потреби – природні, за змістом
        вони тотожні. Це потреба в їжі, сні, продовженні роду. В той же час
        відрізняються вони способами їх задоволення: їсти ложкою, спати на ліжку
        та ін. Усі потреби людини можна розподілити на дві великі групи:
        матеріальні (потреби у предметах побуту, житлі, одязі) та духовні
        (спілкуватися, отримувати інформацію, сприймати прекрасне). Коли потреба
        людини втілюється в конкретні явища або предмети дійсності, утворюється
        більш стійке психічне явище, що носить назву мотиву. За визначенням
        А.М.Леонтьєва, мотив – це опредмечена потреба. Мотиви регулюють
        діяльність людини. Це те, що спонукає до діяльності. Саме мотив дає
        відповідь на питання, чому людина виявляє активність. Усі мотиви можна
        розподілити на усвідомлені та неусвідомлені. До усвідомлених належать
        такі, як інтереси, переконання, прагнення (до складу останніх входять
        мрії, пристрасті, ідеали). Неусвідомлені: установки та потяги.
        Неусвідомлені мотиви через деякий час усвідомлюються. Констатуючою
        ознакою діяльності є наявність мети: є мета – є діяльність. Мета на
        відміну від мотивів завжди усвідомлена. Це своєрідний регулятор
        активності людини. Мета може співпадати, а може й не співпадати з
        мотивом діяльності, як «чому відбувається дія» не завжди співпадає з
        тим, «для чого вона відбувається». Мета – це ідеально представлений
        результат діяльності людини. Для засвоєння тієї або іншої діяльності в
        цілому необхідно опанувати її окремі складові – частини діяльності, що
        носять назву дій. Це окремі фрагменти діяльності, в кожному із яких
        вирішується своя конкретна задача, підпорядкована загальній меті. До
        засобів засвоєння діяльності відносять навички, вміння та операції.
        Навички – це автоматизовані дії, що можуть бути моторними (ходити,
        плавати), сенсомоторними (друкувати, керувати автомобілем, грати на
        роялі), інтелек- 8 туальними (читати, рахувати). Вміння – це володіння
        складною системою психічних та практичних дій, здатність використовувати
        знання та навички. Наприклад: вміння переказувати прочитане складається
        з навику читання як розрізнення букв, слів плюс використання інших слів
        із словникового запасу. Операції – це дії, що відокремились від звичних
        умов, в яких вони виникли. Наприклад, людина найчастіше пише правою
        рукою, але за конкретних умов може написати і лівою, і навіть ногою.
        Проблема формування навичок, вмінь та операцій набуває суттєвого
        значення у педагогічній діяльності. За визначенням А.М.Леонтьєва, життя
        людини – це система діяльностей, що змінюють одна одну. До видів
        людської діяльності належать гра, навчання та праця. Гра – перша
        діяльність людини: ігри з предметами, з іграшками, рольові ігри, ігри за
        правилами. Навчання – засвоєння та передача соціального досвіду. Праця –
        засіб забезпечення життєдіяльності людини та засіб пізнання, спілкування
        та перетворювання навколишнього світу.
      </Text>
      <Text>
        <b>Спілкування</b> Спілкування – багатоплановий процес розвитку
        контактів між людьми. У перекладі з грецької «contaktus» – зіткнення.
        Значення слова свідчить про двобічний зв`язок між тими, хто спілкується.
        У єдиному процесі спілкування для зручності аналізу даного
        багатопланового процесу можна виділити три боки: комунікативний –
        передача та сприйняття інформації; інтерактивний – взаємодія людей, що
        спілкуються, обмін діями та вчинками; перцептивний – сприйняття,
        порозуміння та оцінка один одного у спілкуванні. Комунікативний бік
        передбачає розгляд спілкування з точки зору обміну інформацією. Той, хто
        передає інформацію, – комунікатор, той, хто отримує її, – реципієнт. З
        інтерактивного боку спілкування розглядається як своєрідна система
        зв`язків та міжособистих взаємодій людей, що спілкуються. Перцептивний
        бік – порозуміння, сприйняття та оцінка людьми, що спілкуються, один
        одного: чи заслуговує партнер на увагу, чи цікавий він співрозмовник. 9
        Аналіз комунікативного боку спілкування передбачає розгляд
        співвідношення: вербальні/невербальні засоби організації обміну
        інформації. Найважливіший засіб отримання та передачі інформації – мова.
        Мова та мовлення розглядають у психології як самостійні поняття, що
        відрізняються одне від іншого. Мова – структурна система знаків, за
        кожним із яких має місце своє відповідне значення. Мовлення – це мова у
        дії, головна функція мови. Існує декілька видів мовлення згідно з
        різноманітними підставами класифікації. За способом виконання: читання,
        говоріння, слухання (аудіювання) та безпосередньо мовлення, звучання як
        результату промови. За способом фіксації: писемне та усне мовлення. За
        кількістю осіб, що спілкуються: монолог (промовляє одна людина), діалог
        (спілкуються двоє) та полілог (одна людина спілкується з групою людей).
        Невербальні засоби спілкування: міміка, пози, жести, положення тіла у
        просторі. Дані засоби старіші за вербальні, бо попередником звука був
        жест. Невербальні засоби дуже часто супроводжують вербальні, вони
        посилюють, уточнюють та навіть заміщують вербальну інформацію.
        Інтерактивний бік спілкування, або обмін діями, вчинками, розкривається
        за допомогою таких понять, як такт, соціальна роль та конфлікт. Такт –
        вміння людини чітко та без помилок приписувати іншим очікування того, що
        вони готові від неї почути або в ній побачити. Безтактовність може мати
        як образливий, так і необразливий характер. Щоб процес взаємодії
        відбувався максимально ефективно, у дусі порозуміння, завжди слід мати
        на увазі дотримання так званих соціальних ролей. Соціальна роль –
        нормативно ухвалений зразок поведінки людини, яка виконує ту або іншу
        соціальну функцію. Головна умова безконфліктності спілкування –
        відповідність між соціальною роллю та соціальною нормою, яку ця роль
        передбачає. Інша причина конфліктів – непорозуміння партнерів,
        неспівпадання мети дії, цінностей та заходів досягнення мети. Конфлікти
        за походженням можна розподілити на дві групи: предметноділові та
        особисто-прагматичні. Один вид конфлікту може перетікати в інший.
        Перцептивний бік – сприйняття, порозуміння та оцінка людьми, що
        спілкуються, один одного. Даний процес відбувається завдяки роботі
        відповідних психологічних механізмів. До них належать: ідентифікація,
        рефлексія та стереотипізація. Ідентифікація – посилання на власний
        досвід у процесі спілкування, можливість стати на бік партнера, щоб
        добре зрозуміти його. Рефлексія – розуміння того, як людина сприймається
        партнером. Це своєрідний процес подвійного дзеркального відтворення:
        партнери спостерігають один одного і відповідно планують процес
        спілкування. Стереотипізація – класифікація форм поведінки людини та
        інтерпретація їх причин шляхом віднесення людини, з якою спілкуєшся, до
        вже відомих або тих, що вважаються відомими, типів людей. Стереотип –
        образ людини, що 10 використовується у повсякденному житті як своєрідний
        штамп. Він складається на базі неповноти інформації та висловлювань
        інших людей про дану людину. Ефект ореолу – надання позитивної оцінки
        людині завдяки першому доброму враженню. Він виникає також в умовах
        неповної інформації та попередніх висловлювань про дану людину. Як
        стереотип, так і ефект ореолу деформують процес сприйняття. Критерій
        оцінки – вчинки людей, з якими відбувається спілкування.
      </Text>
      <Text>
        <b>Особистість</b> Поняття індивіда та особистості принципово різні.
        Поняття «індивід» фіксує факт належності людини до роду людей в цілому:
        індивідом є і немовля, і літня людина, і талановитий вчений, і психічно
        неповноцінна людина. Дане поняття відтворює лише родову належність. У
        ході життя, спілкування та діяльності людина набуває особливої якості,
        що носить назву «особистість». Поняття «індивід» та «особистість» єдині,
        але не тотожні. Особистість кожної людини відзначається належними лише
        їй психологічними рисами, що і становлять індивідуальність.
        Індивідуальність – це сполучення психологічних особливостей, своєрідних
        ознак людини, що становлять її своєрідність, її відмінність від інших
        людей. Індивідуальність виявляється у рисах темпераменту, характеру, у
        наявності або відсутності здібностей. Поняття «індивідуальність» та
        «особистість» також єдині, але не тотожні. Структура особистості ширше
        структури індивідуальності, вона містить у собі також аналіз відповідних
        форм поведінки людини, в яких представлено риси індивідуальності
        Особистість формується у процесі діяльності людини та спілкуванні, у
        взаємодії з іншими людьми. Тому аналіз даного поняття відбувається у
        контексті «людина – соціальна група» та вивчається соціальною
        психологією. Вивченням індивідуальних рис людини як частини її
        особистості займається окремий розділ психології, що носить назву
        диференціальна. У цьому розділі вивчаються такі
        індивідуально-психологічні особливості, як темперамент, характер,
        здібності. Особистість можна вивчати також шляхом аналізу її соціальної
        функції, ролі у тій або іншій групі людей. Цей аспект пов`язаний із
        розділом соціальної психології. Поняття особистості складне та
        багатопланове. Знайомство з ним передбачає розкриття змісту таких
        розділів загальної психології, як диференціальна та соціальна. Одним з
        найважливіших понять психології є поняття «Я-концепції». 11
        «Я-концепція» розглядається як соціально-психологічний феномен, під яким
        розуміють складний зіставлений образ, що містить у собі сукупність
        уявлення особистості про саму себе разом з емоційно-оціночними
        компонентами таких уявлень. Подібна концепція формується протягом життя
        людини на базі взаємодії зі своїм психологічним оточенням. Найважливіші
        положення «Я-концепції» можна представити таким чином: поведінка людини
        є результатом її світосприйняття, що містить також відповідну систему
        цінностей із соціокультурного середовища та відбивається у ставленні як
        до себе, так і до інших людей. У структурі «Я-концепції» можна виділити
        три рівні: фізичний Я-образ, зумовлений потребою у фізичному
        благополуччі організму; Я-образ соціальної ідентичності, пов`язаний з
        потребою людини належати до спільноти; диференціюючий Я-образ, що
        характеризує знання про самого себе порівняно з іншими людьми, завдяки
        чому людини може відчувати себе унікальною особистістю та
        самореалізуватися.
      </Text>
    </Container>
  );
};

export default PsychologistLecture;
