import React from 'react';
import { Container, Text, Button } from './CookLecture.styled';
import { Link } from 'react-router-dom';

const CookLecture = () => {
  return (
    <Container>
      <Link to={'/cook'}>
        <Button type="button">Go back</Button>
      </Link>
      <Text>
        <b>Хімічний склад і харчова цінність м'яса.</b> Тканини м'яса М'ясо і
        м'ясні продукти — важливі продукти харчування, оскільки містять усі
        необхідні для організму людини речовини: білки — 16-21 %, жири — 0,5-37,
        вуглеводи — 0,4-0,8, екстрактивні речовини — 2,5-3 %, мінеральні
        речовини — 0,7-1,3, ферменти, вітаміни А, Б, Е, групи В (Вр В2, В6,
        В12). Сировиною для виробництва м'яса і м'ясних продуктів є велика
        рогата худоба, свині, вівці, кози, дикі тварини, кролі, коні. М'ясо — це
        оброблені цілі туші або частини туш забійних тварин, до складу яких
        входять різні тканини організму тварин (м'язова, сполучна, кісткова,
        жирова) і залишкова кількість крові. Хімічний склад й анатомічна будова
        різних тварин неоднакова, тому властивості і харчова цінність м'яса
        залежать від їх кількісного співвідношення в туші, що, в свою чергу,
        залежить від типу і породи тварин, їх статі, віку і вгодованості.
        Середній вміст в туші тканин, %: м'язової — 50-60, жирової — 5-30,
        сполучної — 10-16, кісткової — 9-32. М'язова тканина — основна їстівна
        частина, яка складається з окремих довгих тонких волокон, вкритих тонкою
        напівпрозорою оболонкою (сарколемою). М'язові волокна, сполучаючись,
        утворюють пучки, вкриті оболонкою. Первинні пучки об'єднуються у
        вторинні, які відповідно утворюють пучки третинні, і так далі. Група
        пучків утворює окремий м'яз, вкритий щільнішою оболонкою. Всередині
        м'язового волокна по всій його довжині розміщені ниткоподібні волокна —
        міофібрили, які розділяються між собою саркоплазмою. Залежно від будови
        і характеру скорочення м'язових волокон розрізняють м'язову тканину
        трьох видів: попереково-смугасту, гладеньку і серцеву.
        Попереково-смугаста м'язова тканина, або скелетні м'язи, скорочується
        довільно, червоного кольору. Ця тканина займає більшу частину тіла
        тварини. Гладенькі м'язи мають травні, дихальні органи і діафрагму. Вони
        скорочуються ритмічно, тканина майже безколірна. Серцеві м'язи
        складаються з непаралельно розміщених волокон, які з'єднуються за
        допомогою численних відростків. Харчова цінність м'язової тканини
        залежить від вмісту в ній повноцінних білків (16-20 %), вуглеводів
        (0,4-0,8 %) у вигляді глікогену, жиру (2-4 %), мінеральних речовин
        (1-1,4 %) у вигляді солей кальцію, фосфору, заліза, натрію, цинку, міді,
        марганцю та інших, екстрактивних речовин (2-2,8 %), води (72-75 %), а
        також ферментів і вітамінів. Повноцінні білки міозин, актин, глобулін,
        міоген, міоглобін, міоальбумін легко засвоюються організмом людини.
        Міозин добре поглинає й утримує воду. Він становить близько 40 % всіх
        білків м'язової тканини. Білок актин при взаємодії з міозином утворює
        актоміозин, який має велику в'язкість. Білки міозин, актин і глобулін
        розчиняються у солевих розчинах, решта білки — водорозчинні. Білок
        міоглобін забарвлює м'ясо в червоний колір. При взаємодії з киснем
        повітря міоглобін змінює забарвлення м'яса від світло- до
        темно-червоного. Тому забарвлення м'яса, особливо напівфабрикатів,
        змінюється при їх зберіганні. Глікоген (тваринний крохмаль)
        відкладається в м'язах і печінці. Він є запасною речовиною для
        поповнення крові глюкозою. Після забою тварин глікоген відіграє важливу
        роль при дозріванні м'яса: він перетворюється на молочну кислоту, яка
        розщеплює складні білки, завдяки чому м'язи розслаблюються і відновлюють
        властивість утримувати і поглинати вологу. Екстрактивні речовини
        знаходяться у м'ясі у вигляді азотистих (глікоген) і безазотистих
        (глутамінова кислота) сполук. Вони добре розчиняються у воді, надають
        м'ясу приємного специфічного смаку й аромату, ніжної консистенції. М'ясо
        молодих тварин містить менше екстрактивних речовин. Харчова цінність і
        засвоюваність м'язової тканини залежить і від її розміщення. Найцінніші
        м'язові тканини у тих ділянках туші, які несли при житті тварини мале
        фізичне навантаження. Тому найніжніше м'ясо з м'язових волокон уздовж
        хребта, особливо в поперековій і тазовій частинах. Його використовують
        для смаження. М'язи шиї, черева і нижніх кінцівок (несуть велике фізичне
        навантаження при житті тварини) мають щільну грубоволокнисту будову,
        містять багато щільної й еластинової сполучної тканини. Засвоюваність її
        невисока. Ці частини м'яса використовують для приготування січеної
        натуральної і котлетної маси. * Пам'ятайте: м'ясо поперекової і тазової
        частини має ніжноволокнис- ту будову, містить найбільше повноцінних
        білків. Використовуйте його тільки для смаження. Сполучна тканина
        з'єднує окремі тканини між собою і зі скелетом (плівки, сухожилки,
        суглобові зв'язки, хрящі, окіст). В туші сполучна тканина розподіляється
        нерівномірно, найбільше її в передній частині туші і в нижніх кінцівках.
        Кількість її залежить від вгодованості, віку, виду тварини і частин
        туші. Наприклад, в туші яловичини її 9-12 %, а в туші свинини — 6-8 %.
        До складу сполучної тканини входять вода (58-63 %), неповноцінні білки
        (21-40 %) у вигляді колагену й еластину, мала кількість повноцінних
        білків (альбуміни, глобуліни), жир (1-3 %) і мінеральні речовини
        (0,5-0,7 %). У холодній воді колаген набухає, а при нагріванні з водою
        переходить у розчинний глютин, який при застиганні утворює драглі і
        засвоюється організмом людини. Еластин дуже стійкий до нагрівання, в
        гарячій воді він тільки набухає. Чим більше в м'ясі колагену й еластину,
        тим воно твердіше, а його харчова цінність нижча. Основою сполучної
        тканини є колагенові й еластинові волокна. Залежно від їхнього
        співвідношення і розміщення розрізняють такі види сполучної тканини:
        пухку, щільну, еластинову і сітчасту. Пухка сполучна тканина містить
        колагенові волокна, які зв'язані між собою неміцно і безладно. Вона
        знаходиться між м'язами в шкірі і в підшкірній клітковині, входить до
        складу всіх органів. Щільна сполучна тканина має дуже розвинені
        колагенові волокна, які розміщені паралельними пучками. Вона дуже міцна,
        стійка до нагрівання і механічної обробки, входить до складу сухожилків,
        зв'язок, оболонок м'язів, кісток, хрящів. Еластинова сполучна тканина
        містить велику кількість еластинових волокон, їх багато у
        потилично-шийній зв'язці. Сітчаста сполучна тканина міститься у
        кістковому мозку, селезінці, лімфатичних вузлах. Вона знижує харчову
        цінність м'яса і робить його твердим. Жирова тканина складається з
        кульок жиру, оточених пухкою сполучною тканиною. Залежно від кількості
        жирових відкладень визначається ступінь вгодованості туші. Жир, який
        відкладається біля внутрішніх органів, називається внутрішнім, у
        підшкірній клітковині — підшкірним (жиром-сирцем), між м'язовими
        волокнами — м'язовим жиром. Внутрішньом'язовий жир робить м'ясо
        соковитим, ніжним, поліпшує смакові якості і підвищує його харчову
        цінність. М'ясо, в якому жир відкладається у м'язах у вигляді тонких
        прошарків, називають "мармуровим". Проте великий вміст жиру погіршує
        смак і кулінарні властивості м'яса. Харчова цінність жирової тканини
        обумовлена високою енергетичною цінністю, а також тим, що жири є носіями
        жиророзчинних вітамінів і поліненасичених жирних кислот. Крім того до
        складу жирової тканини входять білки (0,5-7,2 %), мінеральні речовини,
        пігменти і вода (2-21 %). Кісткова тканина — основа скелета тварини,
        найміцніша тканина в організмі. Вона складається з особливих клітин,
        основою яких є осеїн — речовина, яка за своїм складом близька до
        колагену. За будовою і формою кістки бувають трубчасті (кістки
        кінцівок), плоскі (кістки лопатки, ребер, таза, черепа), зубчасті
        (хребці). Кістки містять жир (до 24 %), мінеральні солі (кальцій,
        залізо, хлор, магній, фосфор) і екстрактивні речовини, які при варінні
        переходять у бульйон і надають йому приємного смаку й аромату. Особливо
        цінні кістки таза і пористі закінчення трубчастих кісток, які багаті
        екстрактивними речовинами. Бульйони з цих кісток міцні та ароматні.
        Харчова цінність м'яса залежить від кількості і співвідношення білків,
        жирів, вітамінів, мінеральних речовин, а також ступеня засвоюваності їх
        організмом людини. Білки м'язової тканини засвоюються на 96 %, тваринні
        жири — на 92,4- 97,5 %. Енергетична цінність м'яса залежно від виду,
        вгодованості і віку тварини становить в середньому 377-2046 кДж.
        Класифікація м'яса М'ясо класифікують за видом, статтю, віком,
        вгодованістю тварин і термічним станом. Залежно від виду забійної худоби
        м'ясо поділяють на яловичину, баранину, козлятину, свинину, оленину,
        конину, м'ясо кроликів тощо. М'ясо великої рогатої худоби залежно від
        віку і статі тварин поділяють на яловичину дорослої худоби (м'ясо волів,
        корів, биків) — від тварин віком від 3-х років і більше; яловичину
        молодняка — від 3-х міс. до 3-х років і телятину — від 14 днів до 3 міс.
        М'ясо старих тварин має темне забарвлення м'язів, грубу, щільну,
        великозер- нисту будову, внутрішній жир жовтого кольору. М'ясо волів і
        корів яскраво-червоного кольору, з великою кількістю підшкірного жиру
        від білого до жовтуватого кольору. Будова м'язів щільна, ніжна,
        тонкозерниста, з прошарками жиру. М'ясо яловичини молодняка
        рожево-червоного кольору, м'язи тонкозернисті, жир білий, щільний, легко
        кришиться, прошарків жиру майже немає. Телятина — м'ясо від
        світло-рожевого до сірувато-рожевого кольору, ніжної консистенції.
        Підшкірний жир майже відсутній, внутрішній жир щільний, білого або
        біло-рожевого кольору, сполучна тканина ніжна. На підприємства масового
        харчування яловичина надходить півтушами і четвертинами, телятина —
        тушами і півтушами. М'ясо використовують для смаження, тушкування,
        варіння. Баранина (м'ясо овець). М'ясо молодих тварин світло-червоного
        кольору, консистенція ніжна, м'язи тонкозернисті, прошарки жиру
        відсутні, підшкірний і внутрішній жир білий, щільний, кришиться. М'ясо
        старих тварин цеглово-червоного кольору, грубе, має специфічний запах,
        жир тугоплавкий. Найкращим є м'ясо молодих тварин у віці до 1 року.
        Баранина надходить тушами і півтушами. Її використовують для смаження,
        тушкування і приготування перших страв. Козлятина (м'ясо кіз). М'ясо має
        темніший колір, ніж баранина. Жир щільний, тугоплавкий. Сире і варене
        м'ясо специфічного запаху. Його тушкують і смажать. Надходить тушами і
        півтушами. Свинина. За статтю її поділяють на м'ясо кнурів, кабанів і
        свиноматок. М'ясо кнурів тверде, темного кольору з твердим підшкірним
        жиром і неприємним запахом. Його використовують для промислової
        переробки. М'ясо кабанів і свиноматок за віком поділяють на свинину,
        м'ясо підсвинків і м'ясо поросят-молочників. Свинину дістають від
        тварин, які мають забійну масу понад 34 кг. М'ясо від світло-рожевого до
        червоного кольору, м'язи ніжні, з прошарком жиру, внутрішній жир білий,
        підшкірний — рожевого відтінку. М'ясо молодих свиней, забійна маса яких
        12—38 кг, називають м'ясом підсвинків. Воно ніжніше, ніж свинина,
        світлого кольору. М'ясо поросят-молочників одержують від тварин забійною
        масою від 3 до 6 кг. Воно має дуже ніжні м'язи, колір від блідо-рожевого
        до білого. Свинина надходить тушами і півтушами. Її використовують для
        смаження, тушкування, варіння. Оленину ділять на м'ясо від дорослих
        тварин (віком понад два роки), м'ясо молодняка (від 5 міс. до 2 років) і
        м'ясо оленят (від 14 днів до 5 міс.). Залежно від віку тварини м'ясо
        буває від блідо-червоного до червоного кольору, м'якої консистенції,
        міжм'язовий і підшкірний жир відсутній, жир відкладається у задній
        частині туші. Внутрішній жир білий, щільний. Сполучна тканина пухка.
        Конина. М'ясо коней за віком тварин поділяють на конину (віком від 1
        року і старше), м'ясо лошат (до 1 року). Залежно від вікових
        особливостей м'ясо буває від світло- до темно-червоного кольору, від
        ніжного до грубоволокнистого з незначними жировими відкладеннями. Жир
        м'який, жовтого кольору. Конина на повітрі набуває синюватого відтінку.
        М'ясо кроликів відрізняється дрібнозернистими м'язами, буває від блідо-
        до рожевого кольору, сполучна тканина слабкорозвинута. Залежно від
        вгодованості тварин жир може відкладатися на чубку у вигляді товстих
        смуг або біля нирок. Жир білого кольору, м'який або мажучої
        консистенції. Тушки мають бути добре оброблені, без синяків, залишків
        шкіри, ретельно вимиті. В кулінарії використовують для варіння,
        тушкування, смаження. У кулінарії також використовують м'ясо диких
        тварин (лося, кабана, зайця та ін., після маринування) для смаження,
        тушкування. Колір м'яса від червоного до темно-червоного, запах
        властивий даному виду, консистенція — від щільної до жорсткої з
        наявністю сполучної тканини. Залежно від вгодованості (ступеня розвитку
        жирової, м'язової і кісткової тканин) туші забійних тварин поділяють на
        категорії. Яловичину, баранину, козлятину і м'ясо кролів ділять на І і
        II категорії. Яловичина І категорії від дорослої худоби має задовільно
        розвинені м'язи. Підшкірний жир вкриває тушу від восьмого ребра до
        сідничного горба, а на шиї, лопатках, ребрах, у тазовій частині і в
        ділянці паху є невеликі відкладення жиру. Сідничні горби, маклаки,
        остисті відростки хребців трохи виступають. Яловичина від молодих тварин
        має добре розвинені м'язи. Підшкірні жирові відкладення чітко видно біля
        основи хвоста і на верхній частині внутрішнього боку стегон. Яловичина
        II категорії від дорослої худоби має не дуже добре розвинені м'язи.
        Підшкірний жир є в ділянці крижів, останніх ребер і сідничних горбів.
        Остисті відростки хребців, сідничні горби і маклаки виступають чітко,
        стегна із западинами. У яловичини від молодих тварин м'язи розвинені
        погано (стегна мають западини). Жирові відкладення можуть бути відсутні.
        Остисті відростки хребців, сідничні горби і маклаки виступають чітко.
        М'ясо, яке за вгодованістю має показники нижчі від вимог І і II
        категорій, належить до худого. Категорії вгодованості м'яса позначаються
        клеймом. Яловичина І категорії повинна мати кругле фіолетове клеймо в
        п'яти місцях — на лопатковій, спинній, крижовій, стегновій і грудній
        частинах; яловичина II категорії — квадратне фіолетове у двох місцях —
        на лопатковій і стегновій частинах. На яловичині від молодих тварин І і
        II категорій справа від клейма має бути літера "М". На худій яловичині
        ставлять клеймо червоного кольору у вигляді трикутників на лопатковій і
        стегновій частинах. Таке м'ясо використовують для промислової переробки.
        Баранина І категорії має задовільно розвинені м'язи. Остисті відростки
        хребців біля спини і чубка злегка виступають. Підшкірний жир вкриває
        тонким шаром тушу на спині і злегка на крижах, допускаються
        просвічування біля крижів і таза. На туші баранини І категорії ставлять
        фіолетове кругле клеймо на лопатковій і стегновій частинах з обох боків
        туші, на задній частині — тільки з правого боку. Баранина II категорії
        має слабкорозвинені м'язи. Кістки скелета помітно виступають. Жирові
        відкладення у вигляді тонкого шару, але можуть бути і відсутні.
        Квадратне фіолетове клеймо ставлять на лопатковій і стегновій частинах
        туші з обох боків. Баранина з показниками вгодованості, які нижчі від
        вимог II категорії, належить до худої. На неї ставлять червоне клеймо у
        вигляді трикутника на лопатковій частині з одного боку туші. Худу
        баранину використовують для промислової переробки. Свинину за
        вгодованістю поділяють на п'ять категорій: до І категорії (беконна)
        належать туші свиней з добре розвиненою м'язовою тканиною, особливо на
        спинній і тазостегновій частинах, щільним шпиком білого кольору з
        рожевим відтінком, який рівномірно розміщений по всій довжині півтуші
        1,5—3,5 см завтовшки. Маса туші від 53 до 72 кг; II категорія — м'ясна
        (молодняк) — туші свиней (молодняка) масою від 39 до 96 кг, шпик
        завтовшки 1,5—4 см. До цієї категорії належать туші підсвинків масою
        12—39 кг зі шпиком завтовшки 1 см і більше й обрізна свинина, яку
        дістають від жирних свиней після знімання шпику вздовж усієї довжини
        хребтової частини півтуші на рівні 1 /3 ширини від хребта, а також у
        верхній частині лопатки і стегнової частини. Товщина шпику в місцях його
        відокремлення має бути не більше 0,5 см; III категорія (жирна) — туші
        свиней з необмеженою масою і шпиком завтовшки 4,1 см і більше;
        IVкатегорія (для промислової переробки) — туші свиней масою 90 кг,
        товщина шпику 1,5—4 см; V категорія (м'ясо поросят) — туші
        поросят-молочників масою 3—6 кг. їх шкіра має бути білою або злегка
        рожевою, без синяків, ран, остисті відростки спинних хребців і ребра не
        виступають. Свинина І, II, III і IV категорій надходить тушами і у
        вигляді поздовжніх півтуш. На свинину І категорії ставлять кругле клеймо
        (на лопаткову частину кожної півтуші); II — квадратне; III — овальне; IV
        — трикутне; V — кругле клеймо, справа від нього ставлять літеру "М". На
        свинині для промислової переробки справа від клейма мають бути літери
        "ПП". Залежно від термічного стану (температура в товщі м'язів біля
        кісток) м'ясо поділяють на остигле, охолоджене, підморожене, заморожене.
        Телятину виробляють тільки охолодженою. Через 2-3 год після забою
        тварини настає максимальна пружність і твердість м'язів. На цій стадії
        м'ясо ще зберігає теплоту тіла, дозабійні запахи, має темний колір,
        вологу поверхню на розрізі, запах сирості. Зварене таке м'ясо тверде, а
        бульйон — каламутний, несмачний. В процесі поступового його дозрівання
        розм'якшується м'язова тканина, м'ясо набуває відповідного смаку й
        аромату. Після варіння таке м'ясо соковите, ніжне, бульйон — прозорий,
        смачний, ароматний, з крупними краплинами жиру на поверхні. В середньому
        дозрівання м'яса триває 18-24 год. Це залежить від температури
        навколишнього середовища (чим вона вища, тим швидше іде процес), а також
        від віку і вгодованості тварин (м'ясо молодих тварин дозріває швидше,
        ніж дорослих, а м'ясо вгодованих тварин — повільніше, ніж менш
        вгодованих). Остиглим називають м'ясо, яке після розбирання туш
        піддавалося охолодженню до температури 12 °С. Поверхня туші підсохла,
        м'язи пружні. Остигле м'ясо погано зберігається, тому його відразу ж
        реалізують або охолоджують чи заморожують. Охолодженим називають м'ясо,
        яке має температуру в товщі м'язів біля кісток 0-4 °С. На поверхні
        доброякісного охолодженого м'яса має бути суха кірочка, колір від
        блідо-рожевого до червоного, консистенція щільна, еластична, при
        надавлюванні пальцем ямочка швидко вирівнюється. Охолоджене м'ясо добре
        зберігається. При температурі 2...-1 °С і відносній вологості повітря
        85-90 % охолоджена яловичина зберігається 20 діб, свинина і баранина —
        10 діб. Підморожене м'ясо має в товщі стегна на глибині 1 см температуру
        -3...-5 °С, а в товщі м'язів стегна на глибині 6 см 0-2 °С. При
        зберіганні температура півтуші повинна бути -2...-З °С. Заморожене м'ясо
        має в товщі м'язів біля кісток температуру -8 °С. М'ясо заморожують при
        температурі -18 °С і нижче. Морожене м'ясо на поверхні і в розрізі
        рожево-червоного кольору з сіруватим відтінком за рахунок наявності
        кристаликів льоду, консистенція тверда, при постукуванні вловлюється
        чіткий звук, запаху немає, але при розморожуванні з'являється
        характерний запах м'яса й вогкості. Пам'ятайте: при прийманні м'яса перш
        за все перевіряють наявність клейма вгодованості і
        ветеринарно-санітарного контролю. Н е приймайте м'ясо без клейма.
      </Text>
    </Container>
  );
};

export default CookLecture;
